[
  {
    "path": "posts/2022-05-02-abril-dos-presidenciveis-no-twitter/",
    "title": "Abril dos presidenciáveis no Twitter",
    "description": "Saiba o que tuitam e como são tuitados os presidenciáveis.",
    "author": [
      {
        "name": "Marcelo Castañeda",
        "url": "https://twitter.com/celocastaneda"
      },
      {
        "name": "Alessandra Maia",
        "url": "https://twitter.com/amaiatfaria"
      },
      {
        "name": "Carlos Trucíos",
        "url": "https://ctruciosm.github.io/"
      }
    ],
    "date": "2022-05-02",
    "categories": [],
    "contents": "\nComo os dados foram extraídos\nPara cada candidato, foram coletados tuítes referentes a cada um dos 30 dias do mês de abril, totalizando mais de 11 milhões de tuítes. Os dados foram extraídos através de uma API do twitter utilizada exclusivamente para fins acadêmicos e analisados utilizando o software R.\n\nOs autores agradecem ao Twitter pelas contas acadêmicas a eles concedidas.\nContexto geral\nCabe ressaltar a disparidade entre o número de seguidores no Twitter dos candidatos durante o período de análise (abril, 2022).\nBolsonaro - 7,8 milhões\nLula - 3,4 milhões\nCiro - 1,3 milhões\nTuites dos candidatos\nNa Figura 1 abaixo, apresentamos um gráfico com o número de tuites da timeline dos candidatos, dentre os três que fizeram parte de nosso levantamento: Ciro, Lula e Bolsonaro, de acordo com a frequência com que os candidatos tuitaram no mês abril.\n\n\n\n\nFigure 1: Número de tuítes na timeline dos candidatos\n\n\n\n\nAs Figuras 2 e 3 apresentam as palavras mais frequentes nos tuítes da timeline dos candidatos e as palavras mais frequentes nos tuítes da timeline dos candidatos que não foram tão frequentes nos túites da timeline dos outros candidatos, respectivamente.\n\n\n\n\nFigure 2: Palavras mais frequentes na timeline dos candidatos\n\n\n\n\nA análise das palavras mais frequentes nos tuites da timeline dos candidatos nos permite apresentar um panorama dominante dos assuntos por eles tratados. Enquanto o perfil de Bolsonaro dá destaque aos feitos do governo, em especial os gastos em reais (r) expressos em cifras de milhões e bilhões, o perfil de Lula dá destaque ao povo e traz uma chave positiva, com o termo “bom”. Já o perfil de Ciro, se preocupa em mencionar nominalmente os outros dois candidatos. Por fim, o termo governo é tema comum ao perfil dos três candidatos.\n\n\n\n\nFigure 3: TF-IDF da timeline dos candidados\n\n\n\n\nTF-IDF (term frequency-inverse document frequency) reflete a frequência das palavras nos tuites da timeline dos candidatos que não são tão frequentes para os três candidatos em geral. Assim:\nO perfil de Lula se destaca pelas ações propositivas, através da ênfase dada ao uso de verbos como “fazer, recuperar, reconstruir”.\nO perfil de Bolsonaro apresenta em destaque a palavra “Telegram”, a menção a “ações, bilhões e títulos”, bem como a ênfase em “redução”, procurando comparar o que seu governo realizou entre 2019 e 2021.\nNo perfil de Ciro, a ênfase é dada ao Ceará e Lula.\nVale acrescentar que os três perfis falam das pessoas em si dos candidatos. Ou seja, Lula e Ciro aos nomes diretamente, e Bolsonaro através das referências a “Jair” e “pr”.\nAinda a título de últimas observações, os palavras “ONU, zanin e cristiano” figuram nas menções do perfil de Lula, associadas à decisão do Comitê de Direitos Humanos da ONU sobre sua sentença na Lava Jato. É importante também mencionar que a palavra “et” no perfil do Lula, refere-se à palavra em francês et (que significa “e”) quando tuítes na timeline do candidato são postados em francês. Por último, a alta frequência observada no termo “19h30” na timeline do candidato Ciro Gomes, faz referência à live “Ciro Games” que acontece nesse horário.\nTuites sobre os candidatos\nNa sequência, na Figura 4, apresentamos em ordem decrescente (do mais citado ao menos citado), o total de tuítes que mencionaram o nome de cada candidato pesquisado no mês de abril: Bolsonaro, Lula e Ciro.\n\nPara coletar os tuítes mencionando os respectivos candidatos, foram utilizados como critério de busca as palavras “Bolsonaro”, “Ciro” e “Lula”.\n\n\n\n\nFigure 4: Total de tuítes sobre os candidatos\n\n\n\n\nÉ importante mencionar que, devido ao critério de busca utilizado e como será apresentado posteriormente, os tuítes referentes ao candidato Ciro Gomes incluem também tuítes referentes ao Ministro da Casa Civil, Ciro Nogueira. Apesar disso, o número de tuítes sobre Ciro Gomes é menor do que a oitava parte do número de tuítes referentes ao candidato Jair Bolsonaro e menor do que a quinta parte do número de tuítes referentes ao candidato Luiz Lula. A cada três tuites falando de Bolsonaro, dois falam de Lula; nesse sentido, as interações envolvendo o nome de Ciro não parecem ser relevantes.\n\n\n\n\nFigure 5: Evolução diária da quantitate de tuítes sobre os candidatos\n\n\n\n\nA Figura 5, apresenta a evolução diária do número de tuítes a respeito dos candidatos. A superioriedade do número de tuítes do Lula e Bolsonaro, sobre o número de tuítes de Ciro é indiscutível e persiste ao longo do mês inteiro. Por outro lado, embora o número de tuítes a respeito de Bolsonaro é, em geral, superior ao número de tuítes sobre o candidato Lula, existem 2 períodos do tempo em que o volume de tuítes do Lula supera o volume de tuítes acerca do Bolsonaro.\nNúvem de palavras\nPor fim, apresentamos abaixo três nuvens de palavras, onde cada uma corresponde a um candidato. É importante sinalizar que o nome de cada candidato foi retirado da sua própria nuvem, para melhor visualização das palavras a ele associadas. Cabe ressaltar também, que cada nuvem reflete as 100 palavras mais relevantes associadas, excluídas stop words, a cada candidato nas interações dos usuários do Twitter no último mês de abril.\n\nUma nuvem de palavras é uma representação gráfica das palavras mais frequentes dentro de um texto ou conjunto de textos.\nClique no nome do candidato para ver a respectiva nuvem de palavras.\n\n.panelset{--panel-tab-foreground: honeydew;--panel-tab-background: #0F2E3D;}\n\n\nBolsonaro\n\n\n\n\n\nLula\n\n\n\n\n\nCiro\n\n\n\n\n\n\nAo analisar as nuvens, compartilhamos a primeira impressão de cada uma:\nBolsonaro: em primeiro plano as palavras “presidente”, “Brasil”, “Lula” e “governo’’; em segundo plano, “indulto”, “Daniel” e “Silveira”, que se associam a “STF”, “povo”, e a palavra “contra”; em terceiro plano, vem “motociata”, “corrupção”, “voto” e “PT”. Pode-se destacar que, dentre os candidatos investigados, a nuvem de Bolsonaro é mais dispersa e apresenta menos substantivos.\nLula: em primeiro plano e em igual equivalência aparecem “presidente”, “Alckmin”, “Brasil” e “PT”; em segundo plano “Moro”, “sobre” e “contra”; em terceiro plano, “agora”, “diz”, “Ciro”, “povo”, “ONU”, “ladrão” e “votar”. Pode-se destacar que a nuvem de Lula possui maior densidade na frequência observada das palavras, sejam elas verbos, substantivos ou adjetivos, quando comparada às demais.\nCiro\\(^{\\ast}\\): em primeiro plano, de modo isolado, destacam-se as referências a “Lula” e “Bolsonaro”; em segundo plano, “Nogueira”, “Brasil”, “turno” e “presidente”; em terceiro plano “agrishow”, “agora”, “votar”, voto”, “PT”, “Doria”, “governo”, “contra” e “diz”.\n\n*Fazendo uma busca na plataforma, encontramos tuites direcionados ao ministro da Casa Civil Ciro Nogueira, sendo captados na formação da nuvem do candidato Ciro Gomes nesse mês de abril.\n\nComentários finais\nA apresentação desse conjunto de dados visa contribuir para interpretações sobre a movimentação no Twitter dos possíveis candidatos nas eleições de 2022, bem como sobre o que se fala a seu respeito nas interações dos usuários da plataforma no mês de abril. Esse é um trabalho de pesquisa em andamento e será aperfeiçoado no transcorrer dos meses até a eleição de 2022.\n\n\n\n",
    "preview": "posts/2022-05-02-abril-dos-presidenciveis-no-twitter/Tweets_per_candidato_Abril_.png",
    "last_modified": "2022-05-02T16:25:56-03:00",
    "input_file": "abril-dos-presidenciveis-no-twitter.knit.md",
    "preview_width": 3425,
    "preview_height": 2244
  },
  {
    "path": "posts/2022-03-11-a-semana-dos-presidenciveis-no-twitter-4-a-103/",
    "title": "A semana dos presidenciáveis no Twitter (4 a 10/3)",
    "description": "Saiba o que tuitam e como são tuitados os presidenciáveis.",
    "author": [
      {
        "name": "Marcelo Castañeda",
        "url": "https://twitter.com/celocastaneda"
      },
      {
        "name": "Alessandra Maia",
        "url": "https://twitter.com/amaiatfaria"
      },
      {
        "name": "Carlos Trucíos",
        "url": "https://ctruciosm.github.io/"
      }
    ],
    "date": "2022-03-11",
    "categories": [],
    "contents": "\nComo os dados foram extraídos\nPara cada candidato, foram coletados tuites referentes aos últimos 7 dias (da sexta-feira 4 de março até a quinta-feira 10 de março) totalizando, aproximadamente, 2 milhões de tweets. Os dados foram extraídos através de uma API do twitter utilizada exclusivamente para fins acadêmicos e analisados utilizando o software R.\nContexto geral\nCabe primeiro ressaltar a disparidade entre o número de seguidores no Twitter por candidato pesquisado nessa última semana, o que vai influenciar sobremaneira a análise dos dados.\nBolsonaro - 7,4 milhões\nMoro - 3,3 milhões\nLula - 3,1 milhões\nDória - 1,5 milhões\nCiro - 1,3 milhões\nTuites dos candidatos\nAbaixo apresentamos um gráfico com o número de tuites da timeline dos candidatos, dentre os cinco que fizeram parte de nosso levantamento: Bolsonaro, Ciro, Moro, Lula e Dória, de acordo com a frequência com que os candidatos tuitaram na última semana.\n\n\n\n\n\nTuites sobre os candidatos\nNa sequência apresentamos em ordem decrescente (do mais citado ao menos citado), o total de tuites que mencionaram o nome de cada candidato pesquisado durante a última semana: Bolsonaro, Moro, Lula, Ciro e Dória.\n\nPara coletar os tuites mencionando os respectivos candidatos, foram utilizados como critério de busca as palavras “Bolsonaro”, “Ciro”, “Doria”, “Lula” e “Moro”.\n\n\n\n\n\nPor fim, apresentamos abaixo cinco nuvens de palavras, onde cada uma corresponde a um candidato, é importante sinalizar que o nome de cada candidato foi retirado da sua própria nuvem para melhor visualização das palavras a ele associadas. Cabe ressaltar também, que cada nuvem reflete as 100 palavras mais relevantes associadas, excluídas stop words, a cada candidato nas interações dos usuários do Twitter na última semana.\n\nUma nuvem de palavras é uma representação gráfica das palavras mais frequentes dentro de um texto ou conjunto de textos.\n\nClique no nome do candidato para ver a respectiva nuvem de palavras.\n\n\n.panelset{--panel-tab-foreground: honeydew;--panel-tab-background: #0F2E3D;}\n\n\nBolsonaro\n\n\n\n\n\nMoro\n\n\n\n\n\nLula\n\n\n\n\n\nCiro\n\n\n\n\n\nDoria\n\n\n\n\n\n\nAo analisar as nuvens, compartilhamos a primeira impressão de cada uma:\nBolsonaro: governo, presidente, Brasil e Lula em destaque.\nMoro: Mamãe, MBL, falei, Arthur e Bolsonaro em destaque.\nLula: Bolsonaro, PT, Brasil, presidente e contra em destaque.\nCiro*: presidente, Lula, PRF, convocação e Brasil em destaque.\nDória: vídeo, orgia, Moro e vacina em destaque\n\n*Nos resultados relativos a Ciro, verificamos que termos como PRF e convocação estavam relacionados com uma mobilização entre os dias 8 e 9/3 relativa a um concurso de policiais rodoviários federais pedindo a convocação de candidatos. Fazendo uma busca na plataforma, encontramos tuites direcionados ao ministro da Casa Civil Ciro Nogueira, sendo captado na formação da nuvem do candidato Ciro Gomes nessa semana.\n\nComentários finais\nA apresentação desse conjunto de dados visa contribuir para interpretações sobre a movimentação no Twitter dos possíveis candidatos nas eleições de 2022, bem como sobre o que se fala a seu respeito nas interações dos usuários da plataforma na última semana. Esse é um trabalho de pesquisa em andamento e será aperfeiçoado no transcorrer das semanas.\n\n\n\n",
    "preview": "posts/2022-03-11-a-semana-dos-presidenciveis-no-twitter-4-a-103/Tweets_per_candidato_2022-03-04_2022-03-10.png",
    "last_modified": "2022-03-11T16:23:37-03:00",
    "input_file": {},
    "preview_width": 3425,
    "preview_height": 2244
  }
]
