[
  {
    "path": "posts/2022-11-29-setembro-dos-presidenciveis-no-twitter/",
    "title": "Setembro dos presidenciáveis no Twitter",
    "description": "Saiba o que tuitam e como são tuitados os presidenciáveis.",
    "author": [
      {
        "name": "Marcelo Castañeda",
        "url": "https://twitter.com/celocastaneda"
      },
      {
        "name": "Alessandra Maia",
        "url": "https://twitter.com/amaiatfaria"
      },
      {
        "name": "Carlos Trucíos",
        "url": "https://ctruciosm.github.io/"
      }
    ],
    "date": "2022-11-29",
    "categories": [],
    "contents": "\nComo os dados foram\nextraídos\nPara cada candidato, foram coletados tuítes referentes a cada um dos\n30 dias do mês de setembro, totalizando mais de 34.5 milhões de tuítes,\no maior volume mensal obtido desde o início da pesquisa. Os dados foram\nextraídos através de uma API do twitter utilizada exclusivamente para\nfins acadêmicos e analisados utilizando o software R.\n\nOs autores agradecem ao Twitter pelas contas acadêmicas a eles\nconcedidas.\nNúmero de seguidores\nA seguir, apresentamos o número atualizado (setembro em relação a\nagosto, dados de 29 de novembro de 2022) de seguidores no Twitter de\ncada um dos candidatos.\nBolsonaro - de 9,2 milhões para 10,5 milhões\n(acréscimo de aproximadamente 14 % de seguidores em relação ao mês\nanterior)\nLula - de 4,8 milhões para 6,3 milhões (acréscimo\nde aproximadamente de 31% seguidores em relação ao mês anterior)\nCiro - de 1,5 milhões para 1,6 milhões (acréscimo\nde aproximadamente 6% de seguidores em relação ao mês anterior)\nTuítes dos candidatos\nNa Figura 1 abaixo, apresentamos um gráfico com o número de tuítes da\ntimeline dos candidatos, dentre os três que fazem parte de nosso\nlevantamento: Lula, Ciro e Bolsonaro, de acordo com a frequência com que\nos candidatos tuitaram no mês de agosto.\n\n\n\n\nFigure 1: Número de tuítes na timeline dos candidatos\n\n\n\n\nContinando com o comportamento do mês anterior, Ciro Gomes foi quem\nmais se posicionou na rede social, seguido pelos candidatos Lula da\nSilva e Jair Bolsonaro, respectivamente. Em geral, os três candidatos\naumentaram o número de interações.\nAs Figuras 2 e 3 apresentam as palavras mais frequentes nos tuítes da\ntimeline dos candidatos, e as palavras mais frequentes nos tuítes da\ntimeline dos candidatos que não foram tão frequentes nos tuítes da\ntimeline dos outros candidatos, respectivamente.\n\n\n\n\nFigure 2: Palavras mais frequentes na timeline dos\ncandidatos\n\n\n\n\nA análise das palavras mais frequentes nos tuítes da timeline dos\ncandidatos (Figura 2) nos permite apresentar um panorama dominante dos\nassuntos por eles tratados. Em comum nos três perfis encontramos os\ntermos “povo” e “Brasil”, a novidade é a palavra “povo” que retorna como\ntermo compartilhado. A palavra “hoje” continua frequente para Lula e\nCiro. E agora a palavra “anos” é uma interseção entre o perfil de Ciro e\no de Bolsonaro. No perfil de Bolsonaro isoladamente, aparecem os termos\n“governo”, “país” e “todos”, e se manteve a menção a valores em reais\n(“r”) e “2022”, agora com o número “9“, em provável referência ao mês\ncorrente. No perfil de Lula isoladamente, o destaque para os verbos\n“fazer” e “ter”, o nome “Lula” e os substantivos “país”, “dia”, “hoje”,\n“governo” e o conectivo “porque”, o que denota uma continuidade do\ncaráter propositivo encontrado até agosto, com a novidade do termo\n“porque”, que traz ênfase à explicação. No perfil de Ciro, se mantém a\npreocupação em mencionar nominalmente os outros dois candidatos, bem\ncomo a si mesmo, como observado desde abril. É possível destacar no\nconsolidado do mês setembro, as menções aos termos “sobre”, “programa”,\n“vivo” e “anos”.\n\n\n\n\nFigure 3: TF-IDF da timeline dos candidados\n\n\n\n\nNa Figura 3, TF-IDF (term frequency-inverse document frequency)\nreflete a frequência das palavras nos tuites da timeline dos candidatos,\nque não são tão frequentes para os três candidatos em geral. Assim:\nNo perfil de Lula, a novidade em setembro está nos verbos\n“recuperar”, “reconstruir”, “comer”, “quero” e “viver”, os substantivos\n“desenho”, “Maranhão” e “inclusão” e o adjetivo “bom” e a letra “L”\nmuito provavelmente pela expressividade do slogan “Faz o L!” de sua\ncampanha nas redes .\nO perfil de Bolsonaro apresenta novidades. Os termos que aparecem\nsão “construção”, “títulos”, “pavimentação”, “venda”, “Embrapii”,\n“ponte”, “diesel”, adequação, “km”, “br”, “2019”, “2022” e “kg”.\nNo perfil de Ciro se mantém as menções às palavras “Ciro” e “giro”.\nOs novos termos foram “perca”, “vivo”, “corrupto,“veja”, “candidato”,\n“mínima”, e os números “12” e “2022”..\nTuítes sobre os candidatos\nNa sequência, na Figura 4, apresentamos em ordem decrescente (do mais\ncitado ao menos citado), o total de tuítes que mencionaram o nome de\ncada candidato pesquisado no mês de setembro: Bolsonaro, Lula e\nCiro.\n\nPara coletar os tuites mencionando os respectivos candidatos, foram\nutilizados como critério de busca as palavras “Bolsonaro”, “Ciro” e\n“Lula”. Tuítes mencionando “Ciro Nogueira” foram excluidos das análises\nreferentes ao candidato Ciro.\n\n\n\n\nFigure 4: Total de tuítes sobre os candidatos\n\n\n\n\nO volume de tuítes acerca dos candidatos continua na mesma ordem\nobservada nos meses anteriores: Bolsonaro, Lula e, por último, Ciro. Os\ntrês candidatos evidenciam um aumento expressivo no volume de iterações\ndos usuários mencionando cada um deles. Contudo, o aumento é inferior ao\nobservado no mês anterior.\nA quantidade de tuítes mencionando Bolsonaro foi de 13.455.826 para\n16.784.820 representando um aumento de 24.7% a respeito do mês anterior\n(inferior ao 61% observado no mês anterior).\nA quantidade de tuítes mencionando Lula foi de 10.189.718 para\n13.899.696, representando um aumento de 36% a respeito do mês anterior\n(inferior ao 79% observado no mês anterior)\nPor último, a quantidade de tuítes mencionando Ciro foi de 2.447.570\npara 3.967.878, representando um aumento de 62% a respeito do mês\nanterior (inferior ao 237% observado no mês anterior).\nA evolução diária dos tuítes mencionando cada candidato apresenta-se\nna Figura 5. O maior destaque observa-se na acirrada quantidade de\ntuítes, principalmente, ao final do período, entre os candidatos Jair\nBolsonaro e Lula da Silva, o que converge com o acirramento da disputa\nna campanha eleitoral do país, em torno dos dois candidatos.\n\n\n\n\nFigure 5: Evolução diária da quantitate de tuítes sobre os\ncandidatos\n\n\n\n\nNuvem de palavras\n\nUma nuvem de palavras é uma representação gráfica das palavras mais\nfrequentes dentro de um texto ou conjunto de textos.\nUma nuvem de palavras é uma representação gráfica das palavras mais\nfrequentes dentro de um texto ou conjunto de textos.\nA seguir, apresentamos três nuvens de palavras, onde cada uma\ncorresponde a um candidato. É importante sinalizar que o nome de cada\ncandidato foi retirado da sua própria nuvem, para melhor visualização\ndas palavras associadas. Cabe ressaltar também, que cada nuvem reflete\nas 100 palavras mais relevantes associadas, excluídas stop words, a cada\ncandidato nas interações dos usuários do Twitter nos trinta e um dias do\nmês de agosto.\nClique no nome do candidato para ver a respectiva nuvem de\npalavras.\n\nEm análise de texto, stop words são palavras bastante comuns\ntais como “e”, “de”, “o”, etc. Essas palavras não são úteis para as\nanálises e costumam ser removidas antes das análises.\n\n\n\nBolsonaro\n\n\n\n\nFigure 6: Nuvem de Palavras do Bolsonaro\n\n\n\n\nLula\n\n\n\n\nFigure 7: Nuvem de Palavras do Lula\n\n\n\n\nCiro\n\n\n\n\nFigure 8: Nuvem de Palavras do Ciro\n\n\n\n\n\nAo analisar as nuvens, compartilhamos a primeira impressão de cada\numa:\nBolsonaro: em primeiro plano aparece “Lula” e “presidente”. Em\nsegundo plano, temos as palavras “Brasil”, “turno”, “governo”, “contra”,\n“sobre”, “Ciro”, “TSE”, “22”, “campanha” e “agora”.\nLula: em primeiro plano vemos “Bolsonaro”. Em segundo plano, pelas\npalavras “presidente”, “turno”, “Ciro”, “voto”, “votar”, “PT”,\n“primeiro” e “Brasil”.\nCiro: em primeiro plano Lula e Bolsonaro, mantendo a tendência dos\núltimos meses. Já em segundo plano aparece “turno”, “votar”, “voto”,\n“presidente” e “Tebet” ( a última em menção à também candidata pelo MDB,\nSimone Tebet, que se manteve em relação ao encontrado em agosto).\nAnálise de sentimentos\nO sentimento de cada tuíte foi construído através da identificação\ndos sentimentos das unidades básicas (as palavras) utilizando os\ndicionários oplexicon v3.0 e sentilex, do pacote lexiconPT. Assim, cada\npalavra encontrada nos dicionários recebe a nota 1, -1 ou 0, a depender\nde se o sentimento for positivo, negativo ou neutro, respectivamente.\nPalavras não encontradas nos dicionários recebem também nota 0. Os\nvalores atribuídos a cada palavra dentro do tuíte foram somados, e a\ndepender do resultado positivo, negativo ou zero, o sentimento do tuíte\né classificado como positivo, negativo ou neutro. Na Figura 9 são\napresentados os sentimentos (Negativo, Neutro e Positivo)\npercentualmente por candidato. Esse é um retrato, um instantâneo\nsentimental no mês de agosto e pode-se observar que, proporcional ao\nnúmero de tuítes mencionando cada candidato.\nO candidato Lula obteve a maior porcentagem de tuítes com sentimento\nnegativo (32.57%) e o candidato Bolsonaro a maior porcentagem de tuites\ncom sentimento positivo (29.30%). O candidato Ciro apresenta a maior\nporcentagem de tuites neutros (39.74%).\n\n\n\n\nFigure 9: Sentimentos dos tuítes por candidato\n\n\n\n\nA seguir, é possível observar a nuvem de palavras de cada um dos\ncandidatos, apresentadas em separado, segundo os sentimentos atribuídos\na cada tuíte. Palavras em rosa aparecem nos tuítes classificados como\nassociados a sentimentos positivos, palavras em azul aparecem nos tuítes\nclassificados como associados a sentimentos negativos, e palavras em\nbege aparecem nos tuítes classificados como neutros.\n\nAs nuvens de palavras com sentimentos consideram as 200 palavras mais\nfrequentes.\n\nBolsonaro\n\n\n\n\nFigure 10: Nuvem de Palavras do Bolsonaro com sentimentos.\n\n\n\n\nLula\n\n\n\n\nFigure 11: Nuvem de Palavras do Lula com sentimentos.\n\n\n\n\nCiro\n\n\n\n\nFigure 12: Nuvem de Palavras do Ciro com sentimentos.\n\n\n\n\n\nBolsonaro: Os tuítes relacionados ao candidato\nBolsonaro que foram classificados como associados a sentimentos\npositivos estão caracterizados por palavras como “dinheiro”, “vivo”,\n“reeleito”, “Brasil”, “verdade” e “melhor”. Já os tuítes classificados\ncomo associados a sentimentos negativos são caracterizados por palavras\ncomo “votar”, seguido por “corrupção”, “votar”, “cara”, “vergonha” e\n“presidiário”. Por último, tuítes considerados neutros trazem em\ndestaque “presidente”, “22” e “Lula”.\nLula: Os tuítes relacionados ao candidato Lula que\nforam classificados como associados a sentimentos positivos estão\ncaracterizados por palavras como “votos”, “válidos”, “vitória”, “bom”,\n“mundo” e “novo”. Já os tuítes classificados como negativos estão\ncaracterizados por “votar”, seguido de “corrupção”, “preso”, “cara” e\n“presidiário”. Por último, os tuítes com sentimento neutro estão\ncaracterizados principalmente pelos termos “Bolsonaro” e “presidente”,\nseguido por “turno”, “13” e “primeiro”.\nCiro: Os tuítes relacionados ao candidato Ciro que\nforam classificados como associados a sentimentos positivos estão\ncaracterizados por palavras como “voto”, “útil”, “melhor”, “sabe”,\n“votar”, “mundo” e “verdade”. Já os tuítes classificados como negativos\nestão caracterizados por palavras como “votar”, “vou” e “cara”. Por\núltimo, os tuítes com sentimento neutro estão caracterizados por\npalavras como “Bolsonaro”, “Lula”.\nComentários finais\nA apresentação desse conjunto de dados visa contribuir para\ninterpretações sobre a movimentação no Twitter dos principais candidatos\nsegundo as pesquisas de intenção de voto nas eleições de 2022, bem como\nsobre o que se fala a seu respeito nas interações dos usuários da\nplataforma ao longo do mês de setembro. Esse é um trabalho de pesquisa\nem andamento e será aperfeiçoado no transcorrer dos meses até a eleição\nde 2022.\nAqui você pode ler na íntegra as análises dos meses de abril,\nmaio,\njunho,\njulho\ne agosto.\n\nPesquisadores(as) do IPPUR/UFRJ\ntem um boletim sobre política nas redes aqui.\n\n\n\n\n",
    "preview": "posts/2022-11-29-setembro-dos-presidenciveis-no-twitter/Tweets_per_candidato_Setembro_.png",
    "last_modified": "2022-11-29T12:10:10-03:00",
    "input_file": "setembro-dos-presidenciveis-no-twitter.knit.md",
    "preview_width": 3425,
    "preview_height": 2244
  },
  {
    "path": "posts/2022-10-11-agosto-dos-presidenciveis-no-twitter/",
    "title": "Agosto dos presidenciáveis no Twitter",
    "description": "Saiba o que tuitam e como são tuitados os presidenciáveis.",
    "author": [
      {
        "name": "Marcelo Castañeda",
        "url": "https://twitter.com/celocastaneda"
      },
      {
        "name": "Alessandra Maia",
        "url": "https://twitter.com/amaiatfaria"
      },
      {
        "name": "Carlos Trucíos",
        "url": "https://ctruciosm.github.io/"
      }
    ],
    "date": "2022-10-11",
    "categories": [],
    "contents": "\nComo os dados foram\nextraídos\nPara cada candidato, foram coletados tuítes referentes a cada um dos\n31 dias do mês de agosto, totalizando mais de 26 milhões de tuítes, o\nmaior volume mensal obtido desde o início da pesquisa. Este aumento\ncoincide com o início do período da propaganda eleitoral, ocorrido no\ndia 16 de agosto de 2022. Os dados foram extraídos através de uma API do\ntwitter utilizada exclusivamente para fins acadêmicos e analisados\nutilizando o software R.\n\nOs autores agradecem ao Twitter pelas contas acadêmicas a eles\nconcedidas.\nNúmero de seguidores\nA seguir, apresentamos o número atualizado (agosto em relação a\njulho, dados de 11 de outubro de 2022) de seguidores no Twitter de cada\num dos candidatos.\nBolsonaro - de 8,6 milhões para 9,2 milhões\n(acréscimo de aproximadamente 7% de seguidores em relação ao mês\nanterior)\nLula - de 4 milhões para 4,8 milhões (acréscimo de\naproximadamente 20% de seguidores em relação ao mês anterior)\nCiro - de 1,4 milhões para 1,5 milhões (acréscimo\nde aproximadamente 7% de seguidores em relação ao mês anterior)\nTuítes dos candidatos\nNa Figura 1 abaixo, apresentamos um gráfico com o número de tuítes da\ntimeline dos candidatos, dentre os três que fazem parte de nosso\nlevantamento: Lula, Ciro e Bolsonaro, de acordo com a frequência com que\nos candidatos tuitaram no mês de agosto.\n\n\n\n\nFigure 1: Número de tuítes na timeline dos candidatos\n\n\n\n\nDiferente dos meses de junho e julho, em que o candidato Lula era\nquem mais tuitava na própria timeline, o mês de agosto evidencia uma\nmaior interação do candidato Ciro Gomes na rede social. Já o candidato\nJair Bolsonaro, continua sendo o que menos tuita na própria timeline, um\nfenômeno observado desde o início da nossa pesquisa.\nAs Figuras 2 e 3 apresentam as palavras mais frequentes nos tuítes da\ntimeline dos candidatos, e as palavras mais frequentes nos tuítes da\ntimeline dos candidatos que não foram tão frequentes nos tuítes da\ntimeline dos outros candidatos, respectivamente.\n\n\n\n\nFigure 2: Palavras mais frequentes na timeline dos\ncandidatos\n\n\n\n\nA análise das palavras mais frequentes nos tuítes da timeline dos\ncandidatos (Figura 2) nos permite apresentar um panorama dominante dos\nassuntos por eles tratados. Em comum nos três perfis encontramos os\ntermos “hoje” e “Brasil”, no caso do segundo, mantendo o padrão\nencontrado até julho. A diferença surgiu na menção à palavra “hoje”\npelos três, além da mudança em relação ao termo “povo”, antes mencionado\nfrequentemente nos três perfis. Embora o termo “povo” tenha destaque em\nLula e Ciro, ele é mais frequente no perfil de Lula do que no segundo, e\nnão aparece mais no perfil de Bolsonaro, onde se destaca o termo\n“todos”. Nos perfis de Lula e Ciro, em comum os termos “Lula”, “hoje” e\n“gente”. No perfil de Lula isoladamente, o destaque para os verbos\n“fazer” e “voltar” e os substantivos “dia” e “vida”, o que denota uma\ncontinuidade do caráter propositivo encontrado até julho, com a novidade\ndo termo “vida”, que traz ênfase à construção propositiva. No perfil de\nCiro, se mantém a preocupação em mencionar nominalmente os outros dois\ncandidatos, como observado desde abril. É possível destacar no\nconsolidado do mês de agosto, as menções aos termos “renda”, “programa”\ne “brasileiros”. Por fim, no perfil de Bolsonaro é possível identificar\nque se mantém a menção a valores em reais (“r” ), “2022”, “08” e\n“redução”, o que se consolida no sentido das menções observadas do termo\n“impostos”, novidade em relação ao mês de julho, que confirma nossa\nintuição do mês anterior de que a redução se referiu ao tema.\n\n\n\n\nFigure 3: TF-IDF da timeline dos candidados\n\n\n\n\nNa Figura 3, TF-IDF (term frequency-inverse document frequency)\nreflete a frequência das palavras nos tuites da timeline dos candidatos,\nque não são tão frequentes para os três candidatos em geral. Assim:\nNo perfil de Lula, a novidade em julho está nos termos “gente”,\n“voltar”, “quero”, “Manaus”, “campanha” e “Campina” ( Manaus e Campina\nsão regiões que receberam visita do candidato em campanha). A ênfase que\nse manteve em relação a junho e julho foi o tema da “fome”,\n“reconstruir”e o “juntos” .\nO perfil de Bolsonaro repete os termos “redução” e “drogas”, em\nrelação ao encontrado em julho. A novidade aparece nos termos “Jair”,\n“itens”, “após”, “saneamento”, “mídia”, “ditaduras”, “ton”, “litro” ( da\ngasolina) e “academia”.\nNo perfil de Ciro se mantém as menções às palavras “Ciro” e “giro”.\nAs demais que surgiram em agosto foram “mínima”, “gente”, “Suplicy”,\n“adm”, “Paula”, “Ana”, “ 1.000” e “debates” ( A menção à Ana Paula Matos\nse refere à vice em sua chapa).\nTuítes sobre os candidatos\nNa sequência, na Figura 4, apresentamos em ordem decrescente (do mais\ncitado ao menos citado), o total de tuítes que mencionaram o nome de\ncada candidato pesquisado no mês de julho: Bolsonaro, Lula e Ciro.\n\nPara coletar os tuites mencionando os respectivos candidatos, foram\nutilizados como critério de busca as palavras “Bolsonaro”, “Ciro” e\n“Lula”. Tuítes mencionando “Ciro Nogueira” foram excluidos das análises\nreferentes ao candidato Ciro.\n\n\n\n\nFigure 4: Total de tuítes sobre os candidatos\n\n\n\n\nO volume de tuítes acerca dos candidatos continua na mesma ordem\nobservada nos meses anteriores: Bolsonaro, Lula e, por último, Ciro.\nContudo, o aumento no volume de interações dos usuários mencionando cada\num dos candidatos incrementou expressivamente em todos os casos:\nA quantidade de tuítes mencionando Bolsonaro foi de 8.351.515 para\n13.455.826, representando um aumento de 61% a respeito do mês\nanterior.\nA quantidade de tuítes mencionando Lula foi de 5.663.521 para\n10.189.718, representando um aumento de 79% a respeito do mês\nanterior.\nPor último, a quantidade de tuítes mencionando Ciro foi de 726.072\npara 2.447.570, representando um aumento de 237% a respeito do mês\nanterior.\nA evolução diária dos tuítes mencionando cada candidato apresenta-se\nna Figura 5. Entre os maiores destaques, observa-se o aumento expressivo\ndo Ciro Gomes na última semana de agosto. Outro destaque é o aumento\nexpressivo na quantidade de tuítes envolvendo o candidato Lula, chegando\na ultrapassar, e por muito, a quantidade de tuítes mencionando o\ncandidato Bolsonaro nos dias 25 e 26 de agosto. Estes dias correspondem\nao dia da entrevista do candidato no Jornal Nacional, da Rede Globo de\nTelevisão.\nO primeiro pico observado na evolução diária dos tuítes mencionando\nBolsonaro foi no dia 22 de agosto, dia em que o candidato participou da\nentrevista no Jornal Nacional. Por último, o aumento de tuítes\nmencionando os três candidatos ocorrido no dia 28 de agosto deve-se ao\ndebate presidencial transmitido pela Rede Bandeirantes de Televisão.\n\n\n\n\nFigure 5: Evolução diária da quantitate de tuítes sobre os\ncandidatos\n\n\n\n\nNuvem de palavras\n\nUma nuvem de palavras é uma representação gráfica das palavras mais\nfrequentes dentro de um texto ou conjunto de textos.\nUma nuvem de palavras é uma representação gráfica das palavras mais\nfrequentes dentro de um texto ou conjunto de textos.\nA seguir, apresentamos três nuvens de palavras, onde cada uma\ncorresponde a um candidato. É importante sinalizar que o nome de cada\ncandidato foi retirado da sua própria nuvem, para melhor visualização\ndas palavras associadas. Cabe ressaltar também, que cada nuvem reflete\nas 100 palavras mais relevantes associadas, excluídas stop words, a cada\ncandidato nas interações dos usuários do Twitter nos trinta e um dias do\nmês de agosto.\nClique no nome do candidato para ver a respectiva nuvem de\npalavras.\n\nEm análise de texto, stop words são palavras bastante comuns\ntais como “e”, “de”, “o”, etc. Essas palavras não são úteis para as\nanálises e costumam ser removidas antes das análises.\n\n\n\nBolsonaro\n\n\n\n\nFigure 6: Nuvem de Palavras do Bolsonaro\n\n\n\n\nLula\n\n\n\n\nFigure 7: Nuvem de Palavras do Lula\n\n\n\n\nCiro\n\n\n\n\nFigure 8: Nuvem de Palavras do Ciro\n\n\n\n\n\nAo analisar as nuvens, compartilhamos a primeira impressão de cada\numa:\nBolsonaro: há uma mudança no primeiro plano. Onde\nantes aparecia “Brasil”, vemos agora “Lula” em grande destaque, seguido\nem menor grandeza por “presidente”, “entrevista”, “governo”, “globo” e\n“sobre”.\nLula: em primeiro plano aparecem “presidente”,\nseguido por “Brasil”, “Ciro” e “PT”; em segundo plano “ex”, “votar”,\n“agora”, “entrevista”, “sobre” e “debate”.\nCiro: a tendência dos últimos meses se manteve em\nprimeiro plano “Lula” e “Bolsonaro”, agora o primeiro aparece ainda\nmaior em relação ao segundo. Já em segundo plano aparece “votar”,\nseguido por, “debate”, “brasil”, “presidente” e “Tebet” ( a última em\nmenção à também candidata pelo MDB, Simone Tebet).\nAnálise de sentimentos\nO sentimento de cada tuíte foi construído através da identificação\ndos sentimentos das unidades básicas (as palavras) utilizando os\ndicionários oplexicon v3.0 e sentilex, do pacote lexiconPT. Assim, cada\npalavra encontrada nos dicionários recebe a nota 1, -1 ou 0, a depender\nde se o sentimento for positivo, negativo ou neutro, respectivamente.\nPalavras não encontradas nos dicionários recebem também nota 0. Os\nvalores atribuídos a cada palavra dentro do tuíte foram somados, e a\ndepender do resultado positivo, negativo ou zero, o sentimento do tuíte\né classificado como positivo, negativo ou neutro. Na Figura 9 são\napresentados os sentimentos (Negativo, Neutro e Positivo)\npercentualmente por candidato. Esse é um retrato, um instantâneo\nsentimental no mês de agosto e pode-se observar que, proporcional ao\nnúmero de tuítes mencionando cada candidato.\nO candidato Lula obteve a maior porcentagem de tuítes com sentimento\nnegativo (32.57%) e o candidato Bolsonaro a maior porcentagem de tuites\ncom sentimento positivo (29.30%). O candidato Ciro apresenta a maior\nporcentagem de tuites neutros (39.74%).\n\n\n\n\nFigure 9: Sentimentos dos tuítes por candidato\n\n\n\n\nA seguir, é possível observar a nuvem de palavras de cada um dos\ncandidatos, apresentadas em separado, segundo os sentimentos atribuídos\na cada tuíte. Palavras em rosa aparecem nos tuítes classificados como\nassociados a sentimentos positivos, palavras em azul aparecem nos tuítes\nclassificados como associados a sentimentos negativos, e palavras em\nbege aparecem nos tuítes classificados como neutros.\n\nAs nuvens de palavras com sentimentos consideram as 200 palavras mais\nfrequentes.\n\nBolsonaro\n\n\n\n\nFigure 10: Nuvem de Palavras do Bolsonaro com sentimentos.\n\n\n\n\nLula\n\n\n\n\nFigure 11: Nuvem de Palavras do Lula com sentimentos.\n\n\n\n\nCiro\n\n\n\n\nFigure 12: Nuvem de Palavras do Ciro com sentimentos.\n\n\n\n\n\nBolsonaro: Os tuítes relacionados ao candidato\nBolsonaro que foram classificados como associados a sentimentos\npositivos estão caracterizados por palavras como “vivo”, “reeleito”,\n“mundo” e “melhor”. Já os tuítes classificados como associados a\nsentimentos negativos são caracterizados por palavras como “votar”,\n“cara”, “corrupção” e “presidiário”. Por último, tuítes considerados\nneutros trazem em destaque “presidente”, “Lula”, “jornal” e\n“Globo”.\nLula: Os tuítes relacionados ao candidato Lula que\nforam classificados como associados a sentimentos positivos estão\ncaracterizados por palavras como “mundo”, “melhor”, “ver” e “verdade”.\nJá os tuítes classificados como negativos estão caracterizados por\npalavras como “votar”, “corrupção”, “ex” e “presidiário”. Por último, os\ntuítes com sentimento neutro estão caracterizados principalmente pelos\ntermos “13”, “presidente” e “Bolsonaro”.\nCiro: Os tuítes relacionados ao candidato Ciro que\nforam classificados como associados a sentimentos positivos estão\ncaracterizados por palavras como “melhor”, “preparado”, “ver” e\n“educação. Já os tuítes classificados como negativos estão\ncaracterizados por palavras como “votar”, “vou”, “Lula” e “cara”. Por\núltimo, os tuítes com sentimento neutro estão caracterizados por\npalavras como “Bolsonaro”, “cruel” e “jornal”.\nComentários finais\nA apresentação desse conjunto de dados visa contribuir para\ninterpretações sobre a movimentação no Twitter dos principais candidatos\nsegundo as pesquisas de intenção de voto nas eleições de 2022, bem como\nsobre o que se fala a seu respeito nas interações dos usuários da\nplataforma ao longo do mês de agosto. Esse é um trabalho de pesquisa em\nandamento e será aperfeiçoado no transcorrer dos meses até a eleição de\n2022.\nAqui você pode ler na íntegra as análises dos meses de abril,\nmaio,\njunho\ne julho.\n\nPesquisadores(as) do IPPUR/UFRJ\ntem um boletim sobre política nas redes aqui.\n\n\n\n\n",
    "preview": "posts/2022-10-11-agosto-dos-presidenciveis-no-twitter/evolucao_tweets_candidatos_agosto.png",
    "last_modified": "2022-10-11T10:30:39-03:00",
    "input_file": {},
    "preview_width": 3425,
    "preview_height": 2244
  },
  {
    "path": "posts/2022-08-19-julho-dos-presidenciveis-no-twitter/",
    "title": "Julho dos presidenciáveis no Twitter",
    "description": "Saiba o que tuitam e como são tuitados os presidenciáveis.",
    "author": [
      {
        "name": "Marcelo Castañeda",
        "url": "https://twitter.com/celocastaneda"
      },
      {
        "name": "Alessandra Maia",
        "url": "https://twitter.com/amaiatfaria"
      },
      {
        "name": "Carlos Trucíos",
        "url": "https://ctruciosm.github.io/"
      }
    ],
    "date": "2022-08-19",
    "categories": [],
    "contents": "\nComo os dados foram\nextraídos\nPara cada candidato, foram coletados tuítes referentes a cada um dos\n31 dias do mês de julho, totalizando mais de 14,7 milhões de tuítes. Os\ndados foram extraídos através de uma API do twitter utilizada\nexclusivamente para fins acadêmicos e analisados utilizando o software\nR.\n\nOs autores agradecem ao Twitter pelas contas acadêmicas a eles\nconcedidas.\nNúmero de seguidores\nA seguir, apresentamos o número atualizado (julho em relação a maio,\ndados de 19 de agosto de 2022) de seguidores no Twitter de cada um dos\ncandidatos.\nBolsonaro - de 8,4 milhões para 8,6 (acréscimo de\naproximadamente 2.5 % de seguidores em relação ao mês anterior)\nLula - de 3,8 milhões para 4 milhões (acréscimo de\naproximadamente 5% de seguidores em relação ao mês anterior)\nCiro - 1,4 milhões (não houve alteração em relação\nao mês anterior)\nTuítes dos candidatos\nNa Figura 1 abaixo, apresentamos um gráfico com o número de tuítes da\ntimeline dos candidatos, dentre os três que fazem parte de nosso\nlevantamento: Lula, Ciro e Bolsonaro, de acordo com a frequência com que\nos candidatos tuitaram no mês de junho.\n\n\n\n\nFigure 1: Número de tuítes na timeline dos candidatos\n\n\n\n\nAs Figuras 2 e 3 apresentam as palavras mais frequentes nos tuítes da\ntimeline dos candidatos, e as palavras mais frequentes nos tuítes da\ntimeline dos candidatos que não foram tão frequentes nos tuítes da\ntimeline dos outros candidatos, respectivamente.\n\n\n\n\nFigure 2: Palavras mais frequentes na timeline dos\ncandidatos\n\n\n\n\nA análise das palavras mais frequentes nos tuítes da timeline dos\ncandidatos (Figura 2) nos permite apresentar um panorama dominante dos\nassuntos por eles tratados. Em comum nos três perfis encontramos o termo\n“Brasil”, mantendo o padrão encontrado em maio e junho. A diferença\nsurgiu na menção à palavra “povo”, também mencionada frequentemente nos\ntrês perfis. Embora o termo “povo” tenha destaque em todos os\ncandidatos, ele é mais frequente no perfil de Lula do que nos demais\ncandidatos. Nos perfis de Lula e Ciro, em comum os termos “Lula”,\n“país”, “hoje” e “presidente”. No perfil de Lula isoladamente, o\ndestaque para os verbos “ter” e “fazer” denota uma continuidade do\ncaráter propositivo já encontrado em maio e junho, e a menção a palavras\ncomo “quero”, “hoje” e “juntos”, traz ênfase à construção de propostas.\nNo perfil de Ciro, se mantém a preocupação em mencionar nominalmente os\noutros dois candidatos, como observado em abril, maio e junho. É\npossível destacar no consolidado do mês de junho, as menções aos termos\n“gente” e “governo”. Por fim, no perfil de Bolsonaro é possível\nidentificar termos em inglês, devido a uma sequência de tuítes do dia 27\nde julho em resposta ao Leonardo DiCaprio, a respeito da Amazônia (os\nquais tiveram bastante repercussão na rede). Outros destaques foram a\nmenção a valores em reais (“r”) em termos de “mil”, “2022”, “07” e\n“redução”, sendo este último devido às discussões sobre a redução de\nimpostos.\n\nOs termos em inglês no perfil do Bolsonaro são termos bastante\nfrequentes na língua inglesa. Se stopwords na língua inglesa fossem\ntambém utilizados, os termos teriam desaparecido.\n\n\n\n\nFigure 3: TF-IDF da timeline dos candidados\n\n\n\n\nNa Figura 3, TF-IDF (term frequency-inverse document frequency)\nreflete a frequência das palavras nos tuites da timeline dos candidatos,\nque não são tão frequentes para os três candidatos em geral. Assim:\nNo perfil de Lula, a novidade em julho está nos termos “Alckmin” (em\nreferência ao vice de sua chapa), “juntos”, “reconstruir”, “conversar”,\n“tecnologia”, “cultura”, “queria” e “talhada” ( Serra Talhada e a região\nde Garanhuns em Pernambuco receberam uma visita do candidato cujas\nimagens das multidões viralizaram no site). A ênfase que se manteve em\nrelação a junho foi o tema da “fome”.\nO perfil de Bolsonaro apresenta, novamente, destaque a palavras em\ninglês “the”, “you”, “that” e “and” (referentes aos tuítes em resposta\nao ator Leonardo Dicaprio), bem como destaque aos anos 2019 (que se\nmantém desde o mês de abril, mostrando uma tentativa de ênfase aos\nfeitos do governo no ano anterior à pandemia) e 2022. Também há destaque\npara os termos “redução”, “produtos” e “drogas’’. Termos em inglês\ntambém foram destaque no mês anterior, mas devido à participação do\npresidente na Cúpula das Américas.\nNo perfil de Ciro a novidade em julho é uma pulverização de termos.\n“Ciro”, “pdt”, “candidatura”, “acompanhe”, “escolher”, “nome”, “existe“,\n“voz”, “sugeriram”, “spotify”, “soltar”, “playlist”, “play”,\n“pesquisar”, “oficiais”, “músicas”, “jingles”, “hashtag”, “giro”,\n“estadual”, “cante” e “apertar”. Os termos “spotify”, “playlist”,\n“play”, “giro”, “Ciro” (“O Giro do Ciro” se refere a chamadas com takes\ne visitas da campanha), todos tem relação com a campanha midiática do\ncandidato.\nTuítes sobre os candidatos\nNa sequência, na Figura 4, apresentamos em ordem decrescente (do mais\ncitado ao menos citado), o total de tuítes que mencionaram o nome de\ncada candidato pesquisado no mês de junho: Bolsonaro, Lula e Ciro.\n\nPara coletar os tuites mencionando os respectivos candidatos, foram\nutilizados como critério de busca as palavras “Bolsonaro”, “Ciro” e\n“Lula”. Tuítes mencionando “Ciro Nogueira” foram excluidos das análises\nreferentes ao candidato Ciro.\n\n\n\n\nFigure 4: Total de tuítes sobre os candidatos\n\n\n\n\nEm relação ao mês anterior, as interações de todos os candidatos se\nintensificaram, ou seja, todos estiveram mais assiduamente no Twitter.\nNa evolução diária de tuítes (Figura 5) pode-se verificar que Ciro\napresenta o menor número de interações diárias e Bolsonaro o maior\nnúmero de interações diárias (exceto nos dias 2 e 3 de julho, em que o\nnúmero de tuítes de Lula foi levemente maior). A grande quantidade de\ntuítes mencionando Bolsonaro nos dias 18 e 19 de julho, referem-se à\nmenção ao líder de uma facção criminosa no dia 18 e à redução do preço\nda gasolina no dia 19, quando o presidente afirma que “o Brasil terá uma\ndas ‘gasolina’(sic) mais barata do mundo”.\n\n\n\n\nFigure 5: Evolução diária da quantitate de tuítes sobre os\ncandidatos\n\n\n\n\nNuvem de palavras\n\nUma nuvem de palavras é uma representação gráfica das palavras mais\nfrequentes dentro de um texto ou conjunto de textos.\nA seguir, apresentamos três nuvens de palavras, onde cada uma\ncorresponde a um candidato. É importante sinalizar que o nome de cada\ncandidato foi retirado da sua própria nuvem, para melhor visualização\ndas palavras associadas. Cabe ressaltar também, que cada nuvem reflete\nas 100 palavras mais relevantes associadas, excluídas stop words, a cada\ncandidato nas interações dos usuários do Twitter nos trinta e um dias do\nmês de julho.\nClique no nome do candidato para ver a respectiva nuvem de\npalavras.\n\nEm análise de texto, stop words são palavras bastante comuns\ntais como “e”, “de”, “o”, etc. Essas palavras não são úteis para as\nanálises e costumam ser removidas antes das análises.\n\n\n\nBolsonaro\n\n\n\n\nFigure 6: Nuvem de Palavras do Bolsonaro\n\n\n\n\nLula\n\n\n\n\nFigure 7: Nuvem de Palavras do Lula\n\n\n\n\nCiro\n\n\n\n\nFigure 8: Nuvem de Palavras do Ciro\n\n\n\n\n\nAo analisar as nuvens, compartilhamos a primeira impressão de cada\numa:\nBolsonaro: em primeiro plano se consolidam as\npalavras “Lula” e “Brasil” (mantendo a mesma estrutura do mês anterior).\nEm segundo plano, “governo’’ “contra”, “sobre”, “povo” e “pt”\nLula: em primeiro plano aparecem “PT”, “presidente”\ne “Brasil” (mantendo a mesma estrutura do mês anterior); em segundo\nplano “ex”, “votar”, “contra”, “pcc”, “esquerda” e “povo”.\nCiro: a tendência dos últimos meses se manteve em\nprimeiro plano (“Lula” e “Bolsonaro)”. Já em segundo plano, “voto”,\n“turno” e “Tebet” ( em menção à candidata pelo MDB).\nAnálise de sentimentos\nO sentimento de cada tuíte foi construído através da identificação\ndos sentimentos das unidades básicas (as palavras) utilizando os\ndicionários oplexicon v3.0 e sentilex, do\npacote lexiconPT. Assim, cada palavra encontrada nos\ndicionários recebe a nota 1, -1 ou 0, a depender de se o sentimento for\npositivo, negativo ou neutro, respectivamente. Palavras não encontradas\nnos dicionários recebem também nota 0. Os valores atribuídos a cada\npalavra dentro do tuíte foram somados, e a depender do resultado\npositivo, negativo ou zero, o sentimento do tuíte é classificado como\npositivo, negativo ou neutro. Na Figura 9 são apresentados os\nsentimentos (Negativo, Neutro e Positivo) percentualmente por candidato.\nEsse é um retrato, um instantâneo sentimental no mês de julho e pode-se\nobservar que, proporcional ao número de tuítes mencionando cada\ncandidato, Ciro teve a menor porcentagem de tuítes com sentimento\nnegativo e maior porcentagem de tuítes com sentimentos positivos e\nneutros. Já o candidato Lula teve a maior porcentagem de tuítes\nnegativos e a menor porcentagem de tuítes positivos. Bolsonaro teve a\nmenor porcentagem de tuítes neutros.\n\n\n\n\nFigure 9: Sentimentos dos tuítes por candidato\n\n\n\n\nA seguir, é possível observar a nuvem de palavras de cada um dos\ncandidatos, apresentadas em separado, segundo os sentimentos atribuídos\na cada tuíte. Palavras em rosa aparecem nos tuítes classificados como\nassociados a sentimentos positivos, palavras em azul aparecem nos tuítes\nclassificados como associados a sentimentos negativos, e palavras em\nlaranja aparecem nos tuítes classificados como neutros.\n\nAs nuvens de palavras com sentimentos consideram as 200 palavras mais\nfrequentes.\n\nBolsonaro\n\n\n\n\nFigure 10: Nuvem de Palavras do Bolsonaro com sentimentos.\n\n\n\n\nLula\n\n\n\n\nFigure 11: Nuvem de Palavras do Lula com sentimentos.\n\n\n\n\nCiro\n\n\n\n\nFigure 12: Nuvem de Palavras do Ciro com sentimentos.\n\n\n\n\n\nBolsonaro: Os tuítes relacionados ao candidato\nBolsonaro que foram classificados como associados a sentimentos\npositivos estão caracterizados por palavras como “democracia”, “mundo” e\n“reeleito”. Já os tuítes classificados como associados a sentimentos\nnegativos são caracterizados por palavras como “partido”, “culpa”,\n“corrupção”. Por último, tuítes considerados neutros trazem em destaque\na palavra “presidente”.\nLula: Os tuítes relacionados ao candidato Lula que\nforam classificados como associados a sentimentos positivos estão\ncaracterizados por palavras como “sabe”, “ver”, “bom” e “povo”. Já os\ntuítes classificados como negativos estão caracterizados por palavras\ncomo “votar”, “esquerda”, “segue”. Por último, os tuítes com sentimento\nneutro estão caracterizados principalmente pelo nome “PCC”, “Anitta” e\n“presidente”.\nCiro: Os tuítes relacionados ao candidato Ciro que\nforam classificados como associados a sentimentos positivos estão\ncaracterizados por palavras como “melhor”, “mundo” e “precisa”. Já os\ntuítes classificados como negativos estão caracterizados por palavras\ncomo “votar”. Por último, os tuítes com sentimento neutro estão\ncaracterizados por palavras como “Bolsonaro”, “Tebet” e\n“presidente”.\nBigramas\n\nBigramas são pares de palavras que aparecem conjuntamente ao longo dos\ntuítes.\nOs 25 bigramas mais frequentes nos tuítes mencionando cada um dos\ncandidatos são apresentados nas Figuras 13 – 15. A direção da seta\nrevela a ordem em que o bigrama aparece e quanto maior a intensidade da\nseta, maior a frequência do bigrama.\n\nBolsonaro\n\n\n\n\nFigure 13: Bigramas do Bolsonaro.\n\n\n\n\nLula\n\n\n\n\nFigure 14: Bigramas do Lula.\n\n\n\n\nCiro\n\n\n\n\nFigure 15: Bigramas do Ciro.\n\n\n\n\n\n\\(\\rightarrow\\)\nBolsonaro: entre os bigramas mais frequentes temos\n“governo \\(\\rightarrow\\) Bolsonaro”,\n“Jair \\(\\rightarrow\\) Bolsonaro” e\n“presidente \\(\\rightarrow\\) Bolsonaro”.\nSeguido a estes temos “Michelle \\(\\rightarrow\\) Bolsonaro” (o que pode\nindicar o recente apelo à atuação da primeira dama como estratégia para\nalcançar o público feminino e de evangélicos na campanha), “urnas \\(\\rightarrow\\) eletrônicas”, “Eduardo \\(\\rightarrow\\) Bolsonaro”, “fake \\(\\rightarrow\\) news”, “forças \\(\\rightarrow\\) armadas”, “Marcelo \\(\\rightarrow\\) Arruda”, “primeiro \\(\\rightarrow\\) turno”.\nLula: entre os bigramas mais frequentes temos\n“primeiro \\(\\rightarrow\\) turno”,\n“Marcos \\(\\rightarrow\\) Valerio” e\n“Lula \\(\\rightarrow\\) presidente”,\nseguido por “volta \\(\\rightarrow\\)\nesquerda”, “esquerda \\(\\rightarrow\\)\nsegue”, “ex \\(\\rightarrow\\)\npresidiário”, “povo \\(\\rightarrow\\)\nbrasileiro”, “vou \\(\\rightarrow\\)\nvotar” e “Celso \\(\\rightarrow\\)\nDaniel”. Com uma menor intensidade “rede \\(\\rightarrow\\) globo”, “Jair \\(\\rightarrow\\) Bolsonaro”, “Sergio \\(\\rightarrow\\) Moro” e “fake \\(\\rightarrow\\) news”\nCiro: entre os bigramas mais frequentes temos,\npredominantemente, “Ciro \\(\\rightarrow\\) Gomes”. Entre outros\nbigramas, porém com menor intensidade, temos “Ciro \\(\\rightarrow\\) bloqueou”, “Ciro \\(\\rightarrow\\) Tebet”, “Tebet \\(\\rightarrow\\) ignorou”, “Tebet \\(\\rightarrow\\) comigo”, “encontrar \\(\\rightarrow\\) aceitou” e “voto \\(\\rightarrow\\) impresso”\nComentários finais\nA apresentação desse conjunto de dados visa contribuir para\ninterpretações sobre a movimentação no Twitter dos possíveis candidatos\nnas eleições de 2022, bem como sobre o que se fala a seu respeito nas\ninterações dos usuários da plataforma ao longo do mês de julho. Esse é\num trabalho de pesquisa em andamento e será aperfeiçoado no transcorrer\ndos meses até a eleição de 2022.\nAqui pode lêr na integra as análises dos meses de abril,\nmaio\ne junho.\n\nPesquisadores(as) do IPPUR/UFRJ\ntem um boletim sobre política nas redes aqui.\n\n\n\n\n",
    "preview": "posts/2022-08-19-julho-dos-presidenciveis-no-twitter/Bolsonaro_sentimentos.png",
    "last_modified": "2022-08-19T18:07:08-03:00",
    "input_file": {},
    "preview_width": 1096,
    "preview_height": 718
  },
  {
    "path": "posts/2022-07-19-junho-dos-presidenciveis-no-twitter/",
    "title": "Junho dos presidenciáveis no Twitter",
    "description": "Saiba o que tuitam e como são tuitados os presidenciáveis.",
    "author": [
      {
        "name": "Marcelo Castañeda",
        "url": "https://twitter.com/celocastaneda"
      },
      {
        "name": "Alessandra Maia",
        "url": "https://twitter.com/amaiatfaria"
      },
      {
        "name": "Carlos Trucíos",
        "url": "https://ctruciosm.github.io/"
      }
    ],
    "date": "2022-07-19",
    "categories": [],
    "contents": "\nComo os dados foram extraídos\nPara cada candidato, foram coletados tuítes referentes a cada um dos 30 dias do mês de junho, totalizando mais de 12,7 milhões de tuítes. Os dados foram extraídos através de uma API do twitter utilizada exclusivamente para fins acadêmicos e analisados utilizando o software R.\n\nOs autores agradecem ao Twitter pelas contas acadêmicas a eles concedidas.\nNúmero de seguidores\nA seguir, apresentamos o número atualizado (junho em relação a maio, dados de 19 de julho de 2022) de seguidores no Twitter de cada um dos candidatos.\nBolsonaro - de 8,2 milhões para 8,4 milhões (acréscimo de 2,4% de seguidores em relação ao mês anterior)\nLula - de 3,6 milhões para 3,8 milhões (acréscimo de 5,6% de seguidores em relação ao mês anterior)\nCiro - 1,3 milhões para 1,4 milhões (acréscimo de 7,7% em relação ao mês anterior)\nTuítes dos candidatos\nNa Figura 1 abaixo, apresentamos um gráfico com o número de tuítes da timeline dos candidatos, dentre os três que fazem parte de nosso levantamento: Lula, Ciro e Bolsonaro, de acordo com a frequência com que os candidatos tuitaram no mês de junho.\n\n\n\n\nFigure 1: Número de tuítes na timeline dos candidatos\n\n\n\n\nAs Figuras 2 e 3 apresentam as palavras mais frequentes nos tuítes da timeline dos candidatos, e as palavras mais frequentes nos tuítes da timeline dos candidatos que não foram tão frequentes nos tuítes da timeline dos outros candidatos, respectivamente.\n\n\n\n\nFigure 2: Palavras mais frequentes na timeline dos candidatos\n\n\n\n\nA análise das palavras mais frequentes nos tuítes da timeline dos candidatos (Figura 2) nos permite apresentar um panorama dominante dos assuntos por eles tratados. Em comum nos três perfis encontramos o termo “Brasil”, mantendo o padrão encontrado em maio. Nos perfis de Lula e Ciro, em comum os termos “povo” e “país”. Já entre Lula e Bolsonaro, o termo comum encontrado foi “governo”. No perfil de Lula isoladamente há destaque para os verbos “ter” e “fazer” denotando uma continuidade do caráter propositivo já encontrado anteriormente, bem como a menção a palavras como “gente”, “hoje” e “dia”. No perfil de Ciro, se mantém a preocupação em mencionar nominalmente os outros dois candidatos, como observado em abril e maio. É possível destacar no consolidado do mês de junho, as menções a “política”, “sobre”, “grande” e “todo”. Por fim, no perfil de Bolsonaro é possível apontar uma continuidade, em relação aos meses de abril e maio, com destaque em junho aos feitos do governo, em especial, aos gastos em “reais (r)” expressos em cifras de “milhões”. A novidade consolidada em relação ao mês de maio surge na menção ao termo “empregos” associado a essas cifras, bem como “federal”, “anos” e “2022”.\n\n\n\n\nFigure 3: TF-IDF da timeline dos candidados\n\n\n\n\nNa Figura 3, TF-IDF (term frequency-inverse document frequency) reflete a frequência das palavras nos tuites da timeline dos candidatos, que não são tão frequentes para os três candidatos em geral. Assim:\nNo perfil de Lula, há novidade nas ações propositivas consolidadas em junho, com ênfase dada ao uso dos verbos “construir” e “voltar”. Se observam menos verbos e, por outro lado, mais substantivos novos como “fala”, “povo”, “pobre”, “livro”, “porque”, “fome”, “gente”, “juntos” e “orçamento”. Interessante destacar que o destaque de junho foi a palavra “fome”.\nO perfil de Bolsonaro apresenta em destaque as palavras em inglês “the”, “you” e “and”, estas devem-se à participação do presidente na Cúpula das Américas, mas não trazem nenhum significado importante para nossas análises. A referência ao ano de “2019” se mantém desde o mês de abril, mostrando uma tentativa de ênfase aos feitos do governo no ano anterior à pandemia. As novidades de junho aparecem nas menções às palavras “resíduos”, “Jair”, “produtos”, “pr”, “rodada”, “logística”, “junho” e “bens”.\nNo perfil de Ciro a novidade em junho aparece na ênfase dada aos termos “Ciro”, polarização” e “Lula”. Há também a menção às palavras “turma”, “vivo”, “gente” e “podcast”, bem como aos termos “rol”, “PDT” e “Brizola”.\nTuítes sobre os candidatos\nNa sequência, na Figura 4, apresentamos em ordem decrescente (do mais citado ao menos citado), o total de tuítes que mencionaram o nome de cada candidato pesquisado no mês de junho: Bolsonaro, Lula e Ciro.\n\nPara coletar os tuites mencionando os respectivos candidatos, foram utilizados como critério de busca as palavras “Bolsonaro”, “Ciro” e “Lula”. Tuítes mencionando “Ciro Nogueira” foram excluidos das análises referentes ao candidato Ciro.\n\n\n\n\nFigure 4: Total de tuítes sobre os candidatos\n\n\n\n\nEm relação ao mês de maio, as interações em torno do nome de Bolsonaro em junho se intensificaram, ao passo que as interações mencionando Lula e Ciro diminuíram. É possível destacar que aumenta a distância que separava Bolsonaro de Lula. Em abril, essa distância era de quase 2 milhões de tuítes. Em junho, tal diferença passa dois dois milhões. O número de tuítes mencionando Lula representa aproximadamente 63% do total de tuítes mencionando Bolsonaro, voltando a um patamar parecido com o encontrado em abril (68.12%), mas substancialmente diferente do mês de maio (86.7%). O número de tuítes mencionando Ciro é o menor nos três últimos meses. Comparado com o mês anterior, o número de tuítes mencionando Ciro caiu em mais de 40%\nNa evolução diária de tuítes (Figura 5) pode-se verificar que Ciro apresenta o menor número de iterações diárias. Embora Bolsonaro apresente uma maior interação diária no número de tuítes durante o mês, em quatro momentos os tuítes mencionando Lula foram maiores do que os do Bolsonaro.\n\n\n\n\nFigure 5: Evolução diária da quantitate de tuítes sobre os candidatos\n\n\n\n\nNuvem de palavras\n\nUma nuvem de palavras é uma representação gráfica das palavras mais frequentes dentro de um texto ou conjunto de textos.\nA seguir, apresentamos três nuvens de palavras, onde cada uma corresponde a um candidato. É importante sinalizar que o nome de cada candidato foi retirado da sua própria nuvem, para melhor visualização das palavras associadas. Cabe ressaltar também, que cada nuvem reflete as 100 palavras mais relevantes associadas, excluídas stop words, a cada candidato nas interações dos usuários do Twitter nos últimos quinze dias do mês de abril.\nClique no nome do candidato para ver a respectiva nuvem de palavras.\n\nEm análise de texto, stop words são palavras bastante comuns tais como “e”, “de”, “o”, etc. Essas palavras não são úteis para as análises e costumam ser removidas antes das análises.\n\n\n\n\nBolsonaro\n\n\n\n\nFigure 6: Nuvem de Palavras do Bolsonaro\n\n\n\n\nLula\n\n\n\n\nFigure 7: Nuvem de Palavras do Lula\n\n\n\n\nCiro\n\n\n\n\nFigure 8: Nuvem de Palavras do Ciro\n\n\n\n\n\nAo analisar as nuvens, compartilhamos a primeira impressão de cada uma:\nBolsonaro: em primeiro plano se consolidam as palavras “Lula”, “Brasil” e “governo’’. Em segundo plano, “agora”, “contra”, “sobre”.\nLula: em primeiro plano aparecem “Brasil”, “PT” e “presidente”; em segundo plano “contra”, “governo”, “sobre”.\nCiro: a tendência se manteve em primeiro plano, de modo isolado, destacam-se as referências a “Lula” e “Bolsonaro”; em segundo plano, “turno”, “votar” e “voto”.\nAnálise de sentimentos\nO sentimento de cada tuíte foi construído através da identificação dos sentimentos das unidades básicas (as palavras) utilizando os dicionários oplexicon v3.0 e sentilex, do pacote lexiconPT. Assim, cada palavra encontrada nos dicionários recebe a nota 1, -1 ou 0, a depender de se o sentimento for positivo, negativo ou neutro, respectivamente. Palavras não encontradas nos dicionários recebem também nota 0. Os valores atribuídos a cada palavra dentro do tuíte foram somados, e a depender do resultado positivo, negativo ou zero, o sentimento do tuíte é classificado como positivo, negativo ou neutro. Na Figura 9 são apresentados os sentimentos (Negativo, Neutro e Positivo) percentualmente por candidato. É possível destacar um equilíbrio entre os sentimentos expressos nos tuítes dos três candidatos. Tais dados serão acompanhados ao longo do tempo comparativamente. Esse é um retrato, um instantâneo sentimental no mês de junho.\n\n\n\n\nFigure 9: Sentimentos dos tuítes por candidato\n\n\n\n\nA seguir, é possível observar a nuvem de palavras de cada um dos candidatos, apresentadas em separado, segundo os sentimentos atribuídos a cada tuíte. Palavras em rosa aparecem nos tuítes classificados como associados a sentimentos positivos, palavras em azul aparecem nos tuítes classificados como associados a sentimentos negativos, e palavras em laranja aparecem nos tuítes classificados como neutros.\n\nAs nuvens de palavras com sentimentos consideram as 200 palavras mais frequentes.\n\nBolsonaro\n\n\n\n\nFigure 10: Nuvem de Palavras do Bolsonaro com sentimentos.\n\n\n\n\nLula\n\n\n\n\nFigure 11: Nuvem de Palavras do Lula com sentimentos.\n\n\n\n\nCiro\n\n\n\n\nFigure 12: Nuvem de Palavras do Ciro com sentimentos.\n\n\n\n\n\nBolsonaro: Os tuítes relacionados ao candidato Bolsonaro que foram classificados como associados a sentimentos positivos estão caracterizados por palavras como “mundo”, “ver” e “melhor”. Já os tuites classificados como associados a sentimentos negativos são caracterizados por palavras como “Bruno”, “culpa”, “cara”, “fome” e “Dom”. (Os nomes Bruno e Dom se referem a Bruno Pereira e Dom Philips, respectivamente, indigenista e jornalista, assassinados no Vale do Javari, na Amazônia, no último mês de junho). Por último, tuítes considerados como neutros trazem em destaque a palavra “presidente”.\nLula: Os tuítes relacionados ao candidato Lula que foram classificados como associados a sentimentos positivos estão caracterizados por palavras como “ver”, “sabe”, “mundo” e “bom”. Já os tuítes classificados como negativos estão caracterizados por palavras como “votar”, “fome”, “corrupção” e “presidiário”. Por último, os tuítes com sentimento neutro estão caracterizados principalmente pelo nome “Bolsonaro”.\nCiro: Os tuítes relacionados ao candidato Ciro que foram classificados como associados a sentimentos positivos estão caracterizados por palavras como “melhor”, “sabe” e “precisa”. Já os tuítes classificados como negativos estão caracterizados por palavras como “votar”, “cara” e “culpa”. Por último, os tuítes com sentimento neutro estão caracterizados por palavras como “Lula”, “Bolsonaro” e “presidente”\nBigramas\n\nBigramas são pares de palavras que aparecem conjuntamente ao longo dos tuítes.\nOs 25 bigramas mais frequentes nos tuítes mencionando cada um dos candidatos são apresentados nas Figuras 13 – 15. A direção da seta revela a ordem em que o bigrama aparece e quanto maior a intensidade da seta, maior a frequência do bigrama.\n\nBolsonaro\n\n\n\n\nFigure 13: Bigramas do Bolsonaro.\n\n\n\n\nLula\n\n\n\n\nFigure 14: Bigramas do Lula.\n\n\n\n\nCiro\n\n\n\n\nFigure 15: Bigramas do Ciro.\n\n\n\n\n\nBolsonaro: Bolsonaro: entre os bigramas mais frequentes temos “governo \\(\\rightarrow\\) Bolsonaro”, “Jair \\(\\rightarrow\\) Bolsonaro” e “presidente \\(\\rightarrow\\) Bolsonaro”. Seguido a estes temos a sequência “Presidente \\(\\rightarrow\\) Jair”, “Milton \\(\\rightarrow\\) Ribeiro” , “fake \\(\\rightarrow\\) news”. Também é importante mencionar o bigrama “Dom \\(\\rightarrow\\) Philips” evidenciando a repercussão do assassinato do jornalista inglês na Amazônia.\nLula: entre os bigramas mais frequentes temos “primeiro \\(\\rightarrow\\) turno”, “ex \\(\\rightarrow\\) presidiário”, “Abílio \\(\\rightarrow\\) Diniz” e “governo \\(\\rightarrow\\) Lula”. Outros bigramas, porém com destaque menor, são “Lula \\(\\rightarrow\\) presidente”, “Gilmar \\(\\rightarrow\\) Mendes”, “Renan \\(\\rightarrow\\) Calheiros”, “brigadas \\(\\rightarrow\\) digitais”, “vou \\(\\rightarrow\\) votar” e “Lava \\(\\rightarrow\\) Jato”.\nCiro: entre os bigramas mais frequentes temos, predominantemente, “Ciro \\(\\rightarrow\\) Gomes”, seguido por “vou \\(\\rightarrow\\) votar”, “pré \\(\\rightarrow\\) candidato”, “ex \\(\\rightarrow\\) presidente”, dentre vários outros.\nComentários finais\nA apresentação desse conjunto de dados visa contribuir para interpretações sobre a movimentação no Twitter dos possíveis candidatos nas eleições de 2022, bem como sobre o que se fala a seu respeito nas interações dos usuários da plataforma ao longo do mês de junho. Esse é um trabalho de pesquisa em andamento e será aperfeiçoado no transcorrer dos meses até a eleição de 2022.\nAqui pode lêr na integra as análises dos meses de abril e maio.\n\nPesquisadores(as) do IPPUR/UFRJ tem um boletim sobre política nas redes aqui\n\n\n\n\n",
    "preview": "posts/2022-07-19-junho-dos-presidenciveis-no-twitter/Tweets_sentimentos_candidatos_junho.png",
    "last_modified": "2022-07-26T07:38:00-03:00",
    "input_file": {},
    "preview_width": 3425,
    "preview_height": 2244
  },
  {
    "path": "posts/2022-06-15-maio-dos-presidenciveis-no-twitter/",
    "title": "Maio dos presidenciáveis no Twitter",
    "description": "Saiba o que tuitam e como são tuitados os presidenciáveis.",
    "author": [
      {
        "name": "Marcelo Castañeda",
        "url": "https://twitter.com/celocastaneda"
      },
      {
        "name": "Alessandra Maia",
        "url": "https://twitter.com/amaiatfaria"
      },
      {
        "name": "Carlos Trucíos",
        "url": "https://ctruciosm.github.io/"
      }
    ],
    "date": "2022-06-15",
    "categories": [],
    "contents": "\nComo os dados foram extraídos\nPara cada candidato, foram coletados tuítes referentes a cada um dos 31 dias do mês de maio, totalizando mais de 13 milhões de tuítes. Os dados foram extraídos através de uma API do twitter utilizada exclusivamente para fins acadêmicos e analisados utilizando o software R.\n\nOs autores agradecem ao Twitter pelas contas acadêmicas a eles concedidas.\nNúmero de seguidores\nA seguir, apresentamos o número atualizado (maio em relação a abril, dados de 15 de junho de 2022) de seguidores no Twitter de cada um dos candidatos.\nBolsonaro- de 7,8 para 8,2 milhões (acréscimo de 5,1% de seguidores em relação ao mês anterior)\nLula- de 3,4 para 3,6 milhões ( acréscimo de 5,9% de seguidores em relação ao mês anterior)\nCiro- 1,3 milhões (não foi verificada alteração)\nTuítes dos candidatos\nNa Figura 1 abaixo, apresentamos um gráfico com o número de tuítes da timeline dos candidatos, dentre os três que fazem parte de nosso levantamento: Ciro, Lula e Bolsonaro, de acordo com a frequência com que os candidatos tuitaram no mês de maio.\n\n\n\n\nFigure 1: Número de tuítes na timeline dos candidatos\n\n\n\n\nAs Figuras 2 e 3 apresentam as palavras mais frequentes nos tuítes da timeline dos candidatos, e as palavras mais frequentes nos tuítes da timeline dos candidatos que não foram tão frequentes nos tuítes da timeline dos outros candidatos, respectivamente.\n\n\n\n\nFigure 2: Palavras mais frequentes na timeline dos candidatos\n\n\n\n\nA análise das palavras mais frequentes nos tuítes da timeline dos candidatos (Figura 2) nos permite apresentar um panorama dominante dos assuntos por eles tratados. No perfil de Bolsonaro é possível apontar uma continuidade, em relação ao mês de abril, com destaque aos feitos do governo, em especial, aos gastos em “reais (r)” expressos em cifras de “bilhões” e “milhões”. A novidade consolidada em relação ao mês de abril surge na menção ao termo “impostos” associado a essas cifras. Já o perfil de Lula traz em destaque palavras como “país”, “Brasil”, “povo”, “todos”, “pessoas” e o enfoque no momento de “hoje”. No perfil de Ciro, se mantém a preocupação em mencionar nominalmente os outros dois candidatos, e é possível notar também, no consolidado do mês, as menções ao “povo”, “hoje”, “Brasil”, “gente” e “acompanhe”. Por fim, o termo “Brasil” é uma menção comum observável no perfil dos três candidatos.\n\n\n\n\nFigure 3: TF-IDF da timeline dos candidados\n\n\n\n\nNa Figura 3, TF-IDF (term frequency-inverse document frequency) reflete a frequência das palavras nos tuites da timeline dos candidatos, que não são tão frequentes para os três candidatos em geral. Assim:\nNo perfil de Lula, há uma continuidade nas ações propositivas com mais qualificações, através da ênfase dada ao uso de verbos como “espalhar”, “cuidar”, “estudar”, “trabalhar” e “queremos”. Surgem novos substantivos como “amor”, “universidade” e “universidades”. Interessante destacar que os dois termos, no singular e plural foram o assunto predominante no mês.\nO perfil de Bolsonaro apresenta em destaque os termos “impostos”, “contratação”, “medidas”, “federais”, “km” e “entregues”, termos característicos dos feitos do governo em curso. A referência ao ano de “2019” se mantém em relação ao encontrado em abril, a novidade é a menção ao ano de “2021” e ao número “4”.\nNo perfil de Ciro, a ênfase é dada às palavras “gregorio”, “debate” e “candidato” (referindo-se ao debate entre o candidato e Gregório Duvivier que aconteceu na segunda metade do mês de maio). As últimas palavras mencionadas (“vamos”, “participe”, “porque”, “minha”, “youtube” e “19:30”) fazem referência à live Ciro Games proferida pelo candidato toda terça-feira às 19:30 hrs.\n\nEm geral, pode-se observar que os tuítes do Bolsonaro centram-se nas ações realizadas durante seu governo em curso. Já os tuítes do Lula focam-se nas ações propositivas como candidato. Por último, os tuítes do Ciro destacam os recentes acontecimentos envolvendo o candidato.\n\nTuítes sobre os candidatos\nNa sequência, na Figura 4, apresentamos em ordem decrescente (do mais citado ao menos citado), o total de tuítes que mencionaram o nome de cada candidato pesquisado na primeira quinzena do mês de maio: Bolsonaro, Lula e Ciro.\n\nPara coletar os tuites mencionando os respectivos candidatos, foram utilizados como critério de busca as palavras “Bolsonaro”, “Ciro” e “Lula”. Tuítes mencionando “Ciro Nogueira” foram excluidos das análises referentes ao candidato Ciro.\n\n\n\n\nFigure 4: Total de tuítes sobre os candidatos\n\n\n\n\nEm relação ao mês de abril, se manteve a frequência anterior. É possível destacar, contudo, que diminui a distância que separava Bolsonaro e Lula. Em abril, essa distância era de quase 2 milhões de tuítes. Em maio, tal diferença cai para menos de um milhão. Comparado com o mês anterior, o número de tuítes mencionando os candidatos aumentou em aproximadamente 5% (Bolsonaro), 33% (Lula) e 39% (Ciro). É importante mencionar que a diferença do número de tuítes mencionando Bolsonaro e Lula é menor no mês de maio (menos de um milhão) do que no mês de abril (aproximadamente dois milhões).\nNa evolução diária do número de tuítes (Figura 5), pode-se observar que, em geral, Ciro apresenta a menor quantidade do número de tuítes (exceto no dia 21 de maio onde este número superou levemente o número de tuítes do Lula). Por outro lado, o número de tuítes mencionando Bolsonaro é, geralmente, maior do que os outros candidatos ao longo do mês, com exceção de 7 dias na primeira quinzena do mês, em que Lula apresentou uma quantidade diária de tuítes maior.\n\n\n\n\nFigure 5: Evolução diária da quantitate de tuítes sobre os candidatos\n\n\n\n\nNuvem de palavras\n\nUma nuvem de palavras é uma representação gráfica das palavras mais frequentes dentro de um texto ou conjunto de textos.\nA seguir, apresentamos três nuvens de palavras, onde cada uma corresponde a um candidato. É importante sinalizar que o nome de cada candidato foi retirado da sua própria nuvem, para melhor visualização das palavras associadas. Cabe ressaltar também, que cada nuvem reflete as 100 palavras mais relevantes associadas, excluídas stop words, a cada candidato nas interações dos usuários do Twitter nos 31 dias do mês de maio.\nClique no nome do candidato para ver a respectiva nuvem de palavras.\n\nEm análise de texto, stop words são palavras bastante comuns tais como “e”, “de”, “o”, etc. Essas palavras não são úteis para as análises e costumam ser removidas antes das análises.\n\n\n\n\nBolsonaro\n\n\n\n\nFigure 6: Nuvem de Palavras do Bolsonaro\n\n\n\n\nLula\n\n\n\n\nFigure 7: Nuvem de Palavras do Lula\n\n\n\n\nCiro\n\n\n\n\nFigure 8: Nuvem de Palavras do Ciro\n\n\n\n\n\nAo analisar as nuvens, compartilhamos a primeira impressão de cada uma:\nBolsonaro: em primeiro plano se consolidam as palavras “Lula”, “Brasil” e “governo’’. Em segundo plano, “agora”, “contra”, “Moraes”, “hoje”, “povo”, “turno” e “STF”.\nLula: em primeiro plano aparecem “presidente”, “Brasil”, “PT”, “Ciro” e “turno”; em segundo plano “casamento”, “campanha”, “primeiro”, turno”, “Time”, “pesquisa”, “votar”, “voto”, “porque”, “quer”, “hoje”, “dia”, “gente”, “ter” e “agora”. Vale observar que a menção à palavra “Time” não se limitou à semana em que o ex-presidente Lula é capa da revista Time, mas se manteve no perfil mensal observado.\nCiro: a tendência se manteve em primeiro plano, de modo isolado, destacam-se as referências a “Lula”, “Bolsonaro”, “Gregorio” e “turno”; em segundo plano, “turno”, “Brasil”, “votar”, “agora”, “hoje”, “Duvivier”, e “debate”.\nAnálise de sentimentos\nO sentimento de cada tuíte foi construído através da identificação dos sentimentos das unidades básicas (as palavras) utilizando os dicionários oplexicon v3.0 e sentilex, do pacote lexiconPT. Assim, cada palavra encontrada nos dicionários recebe a nota 1, -1 ou 0, a depender de se o sentimento for positivo, negativo ou neutro, respectivamente. Palavras não encontradas nos dicionários recebem também nota 0. Os valores atribuídos a cada palavra dentro do tuíte foram somados, e a depender do resultado positivo, negativo ou zero, o sentimento do tuíte é classificado como positivo, negativo ou neutro. Na Figura 9 são apresentados os sentimentos (Negativo, Neutro e Positivo) percentualmente por candidato. É possível destacar um equilíbrio entre os sentimentos expressos nos tuítes dos três candidatos. Tais dados serão acompanhados ao longo do tempo comparativamente. Esse é um retrato, um instantâneo sentimental no mês de maio.\n\n\n\n\nFigure 9: Sentimentos dos tuítes por candidato\n\n\n\n\nA seguir, é possível observar a nuvem de palavras de cada um dos candidatos, apresentadas em separado, segundo os sentimentos atribuídos a cada tuíte. Palavras em verde aparecem nos tuítes classificados como associados a sentimentos positivos, palavras em vermelho aparecem nos tuítes classificados como associados a sentimentos negativos, e palavras em amarelo aparecem nos tuítes classificados como neutros.\n\nAs nuvens de palavras com sentimentos consideram as 200 palavras mais frequentes.\n\nBolsonaro\n\n\n\n\nFigure 10: Nuvem de Palavras do Bolsonaro com sentimentos.\n\n\n\n\nLula\n\n\n\n\nFigure 11: Nuvem de Palavras do Lula com sentimentos.\n\n\n\n\nCiro\n\n\n\n\nFigure 12: Nuvem de Palavras do Ciro com sentimentos.\n\n\n\n\n\nBolsonaro: Os tuítes relacionados ao candidato Bolsonaro que foram classificados como associados a sentimentos positivos estão caracterizados por palavras como “mundo”, “presidente”, “bom”, “melhor” e “reeleito”. Já os tuites classificados como associados a sentimentos negativos são caracterizados por palavras como “votar”, “culpa”, “cara” e “preso”. Por último, tuítes considerados como neutros são caracterizados por palavras como “Moraes”, “agora”, “urgente”, “governo” e “2022”.\nLula: Os tuítes relacionados ao candidato Lula que foram classificados como associados a sentimentos positivos estão caracterizados por palavras como “bom”, “sabe”, “mundo”, “ver”, “melhor” e “favor”. Já os tuítes classificados como negativos estão caracterizados por palavras como “votar”, “cara”, “XP” e “presidiário”. Por último, os tuítes com sentimento neutro estão caracterizados por palavras como “sai”, “presidente”, “primeiro”, “13”, “preso”, “Bolsonaro” e “showmício”.\nCiro: Os tuítes relacionados ao candidato Ciro que foram classificados como associados a sentimentos positivos estão caracterizados por palavras como “melhor”, “sabe”, “bom”, “boa” e “ver”. Já os tuítes classificados como negativos estão caracterizados por palavras como “votar”, “cara” e “debater”. Por último, os tuítes com sentimento neutro estão caracterizados por palavras como “fudendo”, “Bolsonaro”, “Doria”, “atrás” e “Lula”.\nBigramas\n\nBigramas são pares de palavras que aparecem conjuntamente ao longo dos tuítes.\nOs 25 bigramas mais frequentes nos tuítes mencionando cada um dos candidatos são apresentados nas Figuras 13 – 15. A direção da seta revela a ordem em que o bigrama aparece e quanto maior a intensidade da seta, maior a frequência do bigrama.\n\nBolsonaro\n\n\n\n\nFigure 13: Bigramas do Bolsonaro.\n\n\n\n\nLula\n\n\n\n\nFigure 14: Bigramas do Lula.\n\n\n\n\nCiro\n\n\n\n\nFigure 15: Bigramas do Ciro.\n\n\n\n\n\nBolsonaro: entre os bigramas mais frequentes temos “presidente \\(\\rightarrow\\) Bolsonaro”, “Jair \\(\\rightarrow\\) Bolsonaro” e “governo \\(\\rightarrow\\) Bolsonaro”. Outros bigramas diretamente relacionados a estes e que chamam nossa atenção são a sequência “Bolsonaro \\(\\rightarrow\\) contra \\(\\rightarrow\\) Alexandre” referindo-se à discrepância entre o atual presidente e o atual ministro do STF. Em sentido similar, as sequências “Flavio \\(\\rightarrow\\) Bolsonaro” e “Eduardo \\(\\rightarrow\\) Bolsonaro” são também frequentes, trazendo a referência a tuítes que podem não necessariamente se referir ao candidato presidencial, mas aos seus filhos. Também é possível destacar as menções laterais “Forças \\(\\rightarrow\\) Armadas”, “Elon \\(\\rightarrow\\) Musk” e “primeiro \\(\\rightarrow\\) turno”.\nLula: entre os bigramas mais frequentes temos “ex \\(\\rightarrow\\) presidente/presidiário \\(\\rightarrow\\) Lula”, que se desdobra, a partir do nome “Lula \\(\\rightarrow\\) quer”, “governo \\(\\rightarrow\\) Lula”, “ Lula \\(\\rightarrow\\) sai”, “Lula \\(\\rightarrow\\) diz”, “Lula \\(\\rightarrow\\) falou”, “Lula \\(\\rightarrow\\) disse”, “Lula \\(\\rightarrow\\) ladrão”, “Lula \\(\\rightarrow\\) nunca”, “Lula \\(\\rightarrow\\) contra“. Secundariamente, “primeiro \\(\\rightarrow\\) turno, “segundo \\(\\rightarrow\\) turno”, “Daniela \\(\\rightarrow\\) Mercury”, “classe \\(\\rightarrow\\) média”, “vou \\(\\rightarrow\\) votar”, “revista \\(\\rightarrow\\) time”, “fake \\(\\rightarrow\\) news”, “dinheiro \\(\\rightarrow\\) público”, dentre outros.\nCiro: entre os bigramas mais frequentes temos, predominantemente, “Ciro \\(\\rightarrow\\) Gomes”, “Ciro \\(\\rightarrow\\) games”, “Ciro \\(\\rightarrow\\) fala”, “Ciro \\(\\rightarrow\\) Lula”, “Sérgio \\(\\rightarrow\\) Moro”, seguido por “Bolsonaro \\(\\rightarrow\\) 31”, “terceira \\(\\rightarrow\\) via”, “segundo \\(\\rightarrow\\) turno”, “todo \\(\\rightarrow\\) mundo”, “ipespe \\(\\rightarrow\\) pesquisa”, “Gregorio \\(\\rightarrow\\) Duvivier”, “voto \\(\\rightarrow\\) útil”, dentre outros.\nComentários finais\nA apresentação desse conjunto de dados visa contribuir para interpretações sobre a movimentação no Twitter dos possíveis candidatos nas eleições de 2022, bem como sobre o que se fala a seu respeito nas interações dos usuários da plataforma no mês de maio. Esse é um trabalho de pesquisa em andamento e será aperfeiçoado no transcorrer dos meses até a eleição de 2022.\n\n\n\n",
    "preview": "posts/2022-06-15-maio-dos-presidenciveis-no-twitter/TF_IDF_timelines_Maio.png",
    "last_modified": "2022-06-22T20:26:06-03:00",
    "input_file": {},
    "preview_width": 3425,
    "preview_height": 2244
  },
  {
    "path": "posts/2022-05-24-maio-dos-presidenciveis-no-twitter-parte-i/",
    "title": "A primeira quinzena de maio dos presidenciáveis no twitter",
    "description": "Saiba o que tuitam e como são tuitados os presidenciáveis.",
    "author": [
      {
        "name": "Marcelo Castañeda",
        "url": "https://twitter.com/celocastaneda"
      },
      {
        "name": "Alessandra Maia",
        "url": "https://twitter.com/amaiatfaria"
      },
      {
        "name": "Carlos Trucíos",
        "url": "https://ctruciosm.github.io/"
      }
    ],
    "date": "2022-05-24",
    "categories": [],
    "contents": "\nComo os dados foram extraídos\nPara cada candidato, foram coletados tuítes referentes a cada um dos primeiros 15 dias do mês de maio, totalizando mais de 7 milhões de tuítes. Os dados foram extraídos através de uma API do twitter utilizada exclusivamente para fins acadêmicos e analisados utilizando o software R.\n\nOs autores agradecem ao Twitter pelas contas acadêmicas a eles concedidas.\nNúmero de seguidores\nA seguir, apresentamos o número atualizado (maio, 2022) de seguidores no Twitter de cada um dos candidatos.\nBolsonaro - 8 milhões (acréscimo de 2,5% de seguidores em relação ao boletim anterior)\nLula - 3,5 milhões ( acréscimo de 2,9% de seguidores em relação ao boletim anterior)\nCiro - 1,3 milhões (não foi verificada alteração)\nTuítes dos candidatos\nNa Figura 1 abaixo, apresentamos um gráfico com o número de tuítes da timeline dos candidatos, dentre os três que fizeram parte de nosso levantamento: Ciro, Lula e Bolsonaro, de acordo com a frequência com que os candidatos tuitaram na primeira quinzena do mês de maio.\n\n\n\n\nFigure 1: Número de tuítes na timeline dos candidatos\n\n\n\n\nAs Figuras 2 e 3 apresentam as palavras mais frequentes nos tuítes da timeline dos candidatos e as palavras mais frequentes nos tuítes da timeline dos candidatos que não foram tão frequentes nos tuítes da timeline dos outros candidatos, respectivamente.\n\n\n\n\nFigure 2: Palavras mais frequentes na timeline dos candidatos\n\n\n\n\n\n\n\n\nFigure 3: TF-IDF da timeline dos candidados\n\n\n\n\nA análise das palavras mais frequentes nos tuítes da timeline dos candidatos (Figura 2) nos permite apresentar um panorama dominante dos assuntos por eles tratados. No perfil de Bolsonaro é possível apontar uma continuidade, em relação ao mês de abril, com destaque aos feitos do governo, em especial, aos gastos em reais (r) expressos em cifras de milhões. A novidade surge na menção ao termo “impostos” associado a essas cifras. Já o perfil de Lula traz em destaque palavras como país, Brasil, povo, todos, pessoas e o enfoque no momento de “hoje”. No perfil de Ciro, se mantém a preocupação em mencionar nominalmente os outros dois candidatos, mas na primeira quinzena de maio, é possível notar menções ao povo, hoje, Brasil, gente e Petrobrás. Por fim, o termo Brasil é uma menção comum observável no perfil dos três candidatos.\nNa Figura 3, TF-IDF (term frequency-inverse document frequency) reflete a frequência das palavras nos tuites da timeline dos candidatos que não são tão frequentes para os três candidatos em geral. Assim:\nNo perfil de Lula, há uma continuidade nas ações propositivas com mais qualificações, através da ênfase dada ao uso de verbos como “defender, ter, recuperar, reconstruir, estudar e cuidar”. Surgem novos substantivos como “soberania” e “universidades”.\nO perfil de Bolsonaro apresenta em destaque os termos “impostos”, “contratação”, “medidas” e “entrega”. A referência ao ano de 2019 se mantém em relação ao encontrado em abril.\nNo perfil de Ciro, a ênfase é dada às ações como “assista” e “participe”, e aos termos “debate”, “Leonel”.\nTuítes sobre os candidatos\nNa sequência, na Figura 4, apresentamos em ordem decrescente (do mais citado ao menos citado), o total de tuítes que mencionaram o nome de cada candidato pesquisado na primeira quinzena do mês de maio: Lula, Bolsonaro e Ciro.\n\nPara coletar os tuites mencionando os respectivos candidatos, foram utilizados como critério de busca as palavras “Bolsonaro”, “Ciro” e “Lula”. Tuítes mencionando “Ciro Nogueira” foram excluidos das análises referentes ao candidato Ciro.\n\n\n\n\nFigure 4: Total de tuítes sobre os candidatos\n\n\n\n\nPara coletar os tuítes mencionando os respectivos candidatos, foram utilizados como critério de busca as palavras “Lula”, “Bolsonaro” e “Ciro”. Em relação ao mês de abril, se reverteu a tendência anterior. É possível destacar que no mês de maio às menções a Lula ultrapassam o número de menções a Bolsonaro, no universo do que foi observado na rede social Twitter.\nNa evolução diária do número de tuítes (Figura 5), pode-se observar que, à exceção dos dias 3 e 5, o número de menções a Lula é superior ao número de menções a Bolsonaro, na primeira semana do mês. Já na segunda semana, apenas nos dias 8 e 11 este mesmo fenômeno acontece, sendo observado o aumento no número de tuítes com menções a Bolsonaro, se considerado Lula, mas com uma distância inferior à observada na primeira semana.\n\n\n\n\nFigure 5: Evolução diária da quantitate de tuítes sobre os candidatos\n\n\n\n\nNuvem de palavras\n\nUma nuvem de palavras é uma representação gráfica das palavras mais frequentes dentro de um texto ou conjunto de textos.\nA seguir, apresentamos três nuvens de palavras, onde cada uma corresponde a um candidato. É importante sinalizar que o nome de cada candidato foi retirado da sua própria nuvem, para melhor visualização das palavras associadas. Cabe ressaltar também, que cada nuvem reflete as 100 palavras mais relevantes associadas, excluídas stop words, a cada candidato nas interações dos usuários do Twitter nos últimos quinze dias do mês de abril.\nClique no nome do candidato para ver a respectiva nuvem de palavras.\n\nEm análise de texto, stop words são palavras bastante comuns tais como “e”, “de”, “o”, etc. Essas palavras não são úteis para as análises e costumam ser removidas antes das análises.\n\n\n\n\nBolsonaro\n\n\n\n\nFigure 6: Nuvem de Palavras do Bolsonaro\n\n\n\n\nLula\n\n\n\n\nFigure 7: Nuvem de Palavras do Lula\n\n\n\n\nCiro\n\n\n\n\nFigure 8: Nuvem de Palavras do Ciro\n\n\n\n\n\nAo analisar as nuvens, compartilhamos a primeira impressão de cada uma:\nBolsonaro: em primeiro plano, as palavras “presidente”, “Brasil”, “Lula” e “governo’’ se mantiveram sem alterações. Em segundo plano, “agora”, “contra”, “sobre”, “povo”, “hoje”; e, em terceiro plano, vem “primeiro”, “turno”, “eleições”, “Moraes”, “2022” e “todos” .\nLula: em primeiro plano aparecem “presidente” e “Brasil”; em segundo plano “time”, “PT”, “povo”, “campanha”, “gente”, “turno”, “sobre”; em terceiro plano, “Daniela”, “Mercury”, “Alckmin”, “ex”, “capa” e “votar”. Vale observar que a menção à palavra “capa” ocorre na semana em que o ex-presidente Lula é capa da revista Time.\nCiro: a tendência se manteve em primeiro plano, de modo isolado, destacam-se as referências a “Lula” e “Bolsonaro”; em segundo plano, “turno”, “Brasil”, “votar” e “voto”; em terceiro plano “coco”, “bambu”, “Doria”, “voto”, “primeiro”, “segundo” e “pesquisa”.\nAnálise de sentimentos\nO sentimento de cada tuíte foi construído através da identificação dos sentimentos das unidades básicas (as palavras) utilizando os dicionários oplexicon v3.0 e sentilex, do pacote lexiconPT. Assim, cada palavra encontrada nos dicionários recebe a nota 1, -1 ou 0, a depender de se o sentimento for positivo, negativo ou neutro, respectivamente. Palavras não encontradas nos dicionários recebem também nota 0. Os valores atribuídos a cada palavra dentro do tuíte foram somados, e a depender do resultado positivo, negativo ou zero, o sentimento do tuíte é classificado como positivo, negativo ou neutro. Na Figura 9 são apresentados os sentimentos (Negativo, Neutro e Positivo) percentualmente por candidato. É possível destacar um equilíbrio entre os sentimentos expressos nos tuítes dos três candidatos. Tais dados serão acompanhados ao longo do tempo comparativamente. Esse é um retrato, um instantâneo sentimental da primeira quinzena de maio.\n\n\n\n\nFigure 9: Sentimentos dos tuítes por candidato\n\n\n\n\nA seguir, é possível observar a nuvem de palavras de cada um dos candidatos, apresentadas em separado, segundo os sentimentos atribuídos a cada tuíte. Palavras em verde aparecem nos tuítes classificados como associados a sentimentos positivos, palavras em vermelho aparecem nos tuítes classificados como associados a sentimentos negativos, e palavras em amarelo aparecem nos tuítes classificados como neutros.\n\nBolsonaro\n\n\n\n\nFigure 10: Nuvem de Palavras do Bolsonaro com sentimentos.\n\n\n\n\nLula\n\n\n\n\nFigure 11: Nuvem de Palavras do Lula com sentimentos.\n\n\n\n\nCiro\n\n\n\n\nFigure 12: Nuvem de Palavras do Ciro com sentimentos.\n\n\n\n\n\nBolsonaro: Os tuítes relacionados ao candidato Bolsonaro que foram classificados como associados a sentimentos positivos estão caracterizados por palavras como bom, presidente, reeleito e santa, entre outros. Já os tuites classificados como associados a sentimentos negativos são caracterizados por palavras como votar, culpa, cara, medo,, etc. Por último, tuítes considerados como neutros são caracterizados por palavras como tirar, governo e urgente.\nLula: Os tuítes relacionados ao candidato Lula que foram classificados como associados a sentimentos positivos estão caracterizados por palavras como segurança, importante, favor, bom, mundo, voto, etc. Já os tuítes classificados como negativos estão caracterizados por palavras como votar, cara, culpa, XP, dar, medo. Por último, os tuítes com sentimento neutro estão caracterizados por palavras como showmício, candidatura, Daniela, Mercury, mesma.\nCiro: Os tuítes relacionados ao candidato Ciro que foram classificados como associados a sentimentos positivos estão caracterizados por palavras como Doria, sabe, melhor, votar, Coco, etc. Já os tuítes classificados como negativos estão caracterizados por palavras como Bolsonaro, votar, cara, como, vagabundo, etc. Por último, os tuítes com sentimento neutro estão caracterizados por palavras como Lula, Tebet, emplacou, bolsonaro, entre outras.\nComentários finais\nA apresentação desse conjunto de dados visa contribuir para interpretações sobre a movimentação no Twitter dos possíveis candidatos nas eleições de 2022, bem como sobre o que se fala a seu respeito nas interações dos usuários da plataforma na primeira quinzena do mês de maio. Esse é um trabalho de pesquisa em andamento e será aperfeiçoado no transcorrer dos meses até a eleição de 2022.\n\n\n\n",
    "preview": "posts/2022-05-24-maio-dos-presidenciveis-no-twitter-parte-i/Tweets_per_candidato_Maio1_.png",
    "last_modified": "2022-05-24T10:17:58-03:00",
    "input_file": {},
    "preview_width": 3425,
    "preview_height": 2244
  },
  {
    "path": "posts/2022-05-02-abril-dos-presidenciveis-no-twitter/",
    "title": "Abril dos presidenciáveis no Twitter",
    "description": "Saiba o que tuitam e como são tuitados os presidenciáveis.",
    "author": [
      {
        "name": "Marcelo Castañeda",
        "url": "https://twitter.com/celocastaneda"
      },
      {
        "name": "Alessandra Maia",
        "url": "https://twitter.com/amaiatfaria"
      },
      {
        "name": "Carlos Trucíos",
        "url": "https://ctruciosm.github.io/"
      }
    ],
    "date": "2022-05-02",
    "categories": [],
    "contents": "\nComo os dados foram extraídos\nPara cada candidato, foram coletados tuítes referentes a cada um dos 30 dias do mês de abril, totalizando mais de 11 milhões de tuítes. Os dados foram extraídos através de uma API do twitter utilizada exclusivamente para fins acadêmicos e analisados utilizando o software R.\n\nOs autores agradecem ao Twitter pelas contas acadêmicas a eles concedidas.\nContexto geral\nCabe ressaltar a disparidade entre o número de seguidores no Twitter dos candidatos durante o período de análise (abril, 2022).\nBolsonaro - 7,8 milhões\nLula - 3,4 milhões\nCiro - 1,3 milhões\nTuítes dos candidatos\nNa Figura 1 abaixo, apresentamos um gráfico com o número de tuítes da timeline dos candidatos, dentre os três que fizeram parte de nosso levantamento: Ciro, Lula e Bolsonaro, de acordo com a frequência com que os candidatos tuitaram no mês abril.\n\n\n\n\nFigure 1: Número de tuítes na timeline dos candidatos\n\n\n\n\nAs Figuras 2 e 3 apresentam as palavras mais frequentes nos tuítes da timeline dos candidatos e as palavras mais frequentes nos tuítes da timeline dos candidatos que não foram tão frequentes nos túites da timeline dos outros candidatos, respectivamente.\n\n\n\n\nFigure 2: Palavras mais frequentes na timeline dos candidatos\n\n\n\n\nA análise das palavras mais frequentes nos tuítes da timeline dos candidatos nos permite apresentar um panorama dominante dos assuntos por eles tratados. Enquanto o perfil de Bolsonaro dá destaque aos feitos do governo, em especial os gastos em reais (r) expressos em cifras de milhões e bilhões, o perfil de Lula dá destaque ao povo e traz uma chave positiva, com o termo “bom”. Já o perfil de Ciro, se preocupa em mencionar nominalmente os outros dois candidatos. Por fim, o termo governo é tema comum ao perfil dos três candidatos.\n\n\n\n\nFigure 3: TF-IDF da timeline dos candidados\n\n\n\n\nTF-IDF (term frequency-inverse document frequency) reflete a frequência das palavras nos tuítes da timeline dos candidatos que não são tão frequentes para os três candidatos em geral. Assim:\nO perfil de Lula se destaca pelas ações propositivas, através da ênfase dada ao uso de verbos como “fazer, recuperar, reconstruir”.\nO perfil de Bolsonaro apresenta em destaque a palavra “Telegram”, a menção a “ações, bilhões e títulos”, bem como a ênfase em “redução”, procurando comparar o que seu governo realizou entre 2019 e 2021.\nNo perfil de Ciro, a ênfase é dada ao Ceará e Lula.\nVale acrescentar que os três perfis falam das pessoas em si dos candidatos. Ou seja, Lula e Ciro aos nomes diretamente, e Bolsonaro através das referências a “Jair” e “pr”.\nAinda a título de últimas observações, os palavras “ONU, zanin e cristiano” figuram nas menções do perfil de Lula, associadas à decisão do Comitê de Direitos Humanos da ONU sobre sua sentença na Lava Jato. É importante também mencionar que a palavra “et” no perfil do Lula, refere-se à palavra em francês et (que significa “e”) quando tuítes na timeline do candidato são postados em francês. Por último, a alta frequência observada no termo “19h30” na timeline do candidato Ciro Gomes, faz referência à live “Ciro Games” que acontece nesse horário.\nTuítes sobre os candidatos\nNa sequência, na Figura 4, apresentamos em ordem decrescente (do mais citado ao menos citado), o total de tuítes que mencionaram o nome de cada candidato pesquisado no mês de abril: Bolsonaro, Lula e Ciro.\n\nPara coletar os tuítes mencionando os respectivos candidatos, foram utilizados como critério de busca as palavras “Bolsonaro”, “Ciro” e “Lula”.\n\n\n\n\nFigure 4: Total de tuítes sobre os candidatos\n\n\n\n\nÉ importante mencionar que, devido ao critério de busca utilizado e como será apresentado posteriormente, os tuítes referentes ao candidato Ciro Gomes incluem também tuítes referentes ao Ministro da Casa Civil, Ciro Nogueira. Apesar disso, o número de tuítes sobre Ciro Gomes é menor do que a oitava parte do número de tuítes referentes ao candidato Jair Bolsonaro e menor do que a quinta parte do número de tuítes referentes ao candidato Luiz Lula. A cada três tuites falando de Bolsonaro, dois falam de Lula; nesse sentido, as interações envolvendo o nome de Ciro não parecem ser relevantes.\n\n\n\n\nFigure 5: Evolução diária da quantitate de tuítes sobre os candidatos\n\n\n\n\nA Figura 5 apresenta a evolução diária do número de tuítes a respeito dos candidatos. A superioridade do número de tuítes que mencionam Lula e Bolsonaro em relação ao número de tuítes que mencionam Ciro é indiscutível e persiste ao longo do mês inteiro. Por outro lado, embora o número de tuítes a respeito de Bolsonaro seja, em geral, superior ao número de tuítes sobre o candidato Lula, existem 2 períodos do tempo em que o volume de tuítes sobre Lula supera o volume de tuítes acerca de Bolsonaro.\nNuvem de palavras\n\nUma nuvem de palavras é uma representação gráfica das palavras mais frequentes dentro de um texto ou conjunto de textos.\nPor fim, apresentamos abaixo três nuvens de palavras, onde cada uma corresponde a um candidato. É importante sinalizar que o nome de cada candidato foi retirado da sua própria nuvem, para melhor visualização das palavras a ele associadas. Cabe ressaltar também, que cada nuvem reflete as 100 palavras mais relevantes associadas, excluídas stop words, a cada candidato nas interações dos usuários do Twitter no último mês de abril.\nClique no nome do candidato para ver a respectiva nuvem de palavras.\n\nEm análise de texto, stop words são palavras bastante comuns tais como “e”, “de”, “o”, etc. Essas palavras não são úteis para as análises e costumam ser removidas antes das análises.\n\n\n\n\nBolsonaro\n\n\n\n\n\nLula\n\n\n\n\n\nCiro\n\n\n\n\n\n\nAo analisar as nuvens, compartilhamos a primeira impressão de cada uma:\nBolsonaro: em primeiro plano, as palavras “presidente”, “Brasil”, “Lula” e “governo’’; em segundo plano, “indulto”, “Daniel” e “Silveira”, que se associam a “STF”, “povo”, e a palavra “contra”; em terceiro plano, vem “motociata”, “corrupção”, “voto” e “PT”. Pode-se destacar que, dentre os candidatos investigados, a nuvem de Bolsonaro é mais dispersa e apresenta menos substantivos.\nLula: em primeiro plano, e em igual equivalência aparecem “presidente”, “Alckmin”, “Brasil” e “PT”; em segundo plano “Moro”, “sobre” e “contra”; em terceiro plano, “agora”, “diz”, “Ciro”, “povo”, “ONU”, “ladrão” e “votar”. Pode-se destacar que a nuvem de Lula possui maior densidade na frequência observada das palavras, sejam elas verbos, substantivos ou adjetivos, quando comparada às demais.\nCiro\\(^{\\ast}\\): em primeiro plano, de modo isolado, destacam-se as referências a “Lula” e “Bolsonaro”; em segundo plano, “Nogueira”, “Brasil”, “turno” e “presidente”; em terceiro plano “agrishow”, “agora”, “votar”, voto”, “PT”, “Doria”, “governo”, “contra” e “diz”.\n\n*Fazendo uma busca na plataforma, encontramos tuites direcionados ao ministro da Casa Civil Ciro Nogueira, sendo captados na formação da nuvem do candidato Ciro Gomes nesse mês de abril.\n\nAnálise de sentimentos\nO sentimento de cada tuíte foi construído através da identificação dos sentimentos das unidades básicas (as palavras) utilizando os dicionários oplexicon v3.0 e sentilex, do pacote lexiconPT. Assim, cada palavra encontrada nos dicionários recebe a nota 1, -1 ou 0, a depender de se o sentimento for positivo, negativo ou neutro, respectivamente. Palavras não encontradas nos dicionários recebem também nota 0. Os valores atribuídos a cada palavra dentro do tuíte foram somados, e a depender do resultado positivo, negativo ou zero, o sentimento do tuíte é classificado como positivo, negativo ou neutro.\nA seguir, é possível observar a nuvem de palavras de cada um dos candidatos, apresentada em separado, segundo os sentimentos atribuídos a cada tuíte. Palavras em verde aparecem nos tuítes classificados como associados a sentimentos positivos, palavras em vermelho aparecem nos tuítes classificados como associados a sentimentos negativos, e palavras em amarelo aparecem nos tuítes classificados como neutros.\n\nBolsonaro\n\n\n\n\n\nLula\n\n\n\n\n\nCiro\n\n\n\n\n\n\nBolsonaro\nOs tuítes relacionados ao candidato Bolsonaro que foram classificados como associados a sentimentos positivos estão caracterizados por palavras como Brasil, liberdade, reeleito, supremo, democracia, entre outros. Já os tuites classificados como associados a sentimentos negativos são caracterizados por palavras como corrupção, corrupto, culpa, votar, bandido, governo, tortura, vergonha, horrível, mentiroso, etc. Por último, tuítes considerados como neutros são caracterizados por palavras como presidente, indulto, lula e motociata.\nLula\nOs tuítes relacionados ao candidato Lula que foram classificados como associados a sentimentos positivos estão caracterizados por palavras como bom, verdade, mundo, sabe, ver, onu, livre, inocente, democracia, humanos, companheiros, direitos, melhor, novo, etc. Já os tuítes classificados como negativos estão caracterizados por palavras como votar, corrupção, presidiário, condenado, prisão, bandido. Por último, os tuítes com sentimento neutro estão caracterizados por palavras como Bolsonaro, Alckmin, socialista, internacional, cristão, advogados.\nCiro\nOs tuítes relacionados ao candidato Ciro que foram classificados como associados a sentimentos positivos estão caracterizados por palavras como convocação, aprovados, todos, pf, ver, etc. Já os tuítes classificados como negativos estão caracterizados por palavras como Bolsonaro, votar, pensa, corrupção, xingado, ignorado, quadrilhão, agrishow, vaiado, etc. Por último, os tuítes com sentimento neutro estão caracterizados por palavras como Lula, contra, pl, 21, nunca, evento entre outras.\nComentários finais\nA apresentação desse conjunto de dados visa contribuir para interpretações sobre a movimentação no Twitter dos possíveis candidatos nas eleições de 2022, bem como sobre o que se fala a seu respeito nas interações dos usuários da plataforma no mês de abril. Esse é um trabalho de pesquisa em andamento e será aperfeiçoado no transcorrer dos meses até a eleição de 2022.\n\n\n\n",
    "preview": "posts/2022-05-02-abril-dos-presidenciveis-no-twitter/Tweets_per_candidato_Abril_.png",
    "last_modified": "2022-05-06T12:07:51-03:00",
    "input_file": {},
    "preview_width": 3425,
    "preview_height": 2244
  },
  {
    "path": "posts/2022-03-11-a-semana-dos-presidenciveis-no-twitter-4-a-103/",
    "title": "A semana dos presidenciáveis no Twitter (4 a 10/3)",
    "description": "Saiba o que tuitam e como são tuitados os presidenciáveis.",
    "author": [
      {
        "name": "Marcelo Castañeda",
        "url": "https://twitter.com/celocastaneda"
      },
      {
        "name": "Alessandra Maia",
        "url": "https://twitter.com/amaiatfaria"
      },
      {
        "name": "Carlos Trucíos",
        "url": "https://ctruciosm.github.io/"
      }
    ],
    "date": "2022-03-11",
    "categories": [],
    "contents": "\nComo os dados foram extraídos\nPara cada candidato, foram coletados tuites referentes aos últimos 7 dias (da sexta-feira 4 de março até a quinta-feira 10 de março) totalizando, aproximadamente, 2 milhões de tweets. Os dados foram extraídos através de uma API do twitter utilizada exclusivamente para fins acadêmicos e analisados utilizando o software R.\nContexto geral\nCabe primeiro ressaltar a disparidade entre o número de seguidores no Twitter por candidato pesquisado nessa última semana, o que vai influenciar sobremaneira a análise dos dados.\nBolsonaro - 7,4 milhões\nMoro - 3,3 milhões\nLula - 3,1 milhões\nDória - 1,5 milhões\nCiro - 1,3 milhões\nTuites dos candidatos\nAbaixo apresentamos um gráfico com o número de tuites da timeline dos candidatos, dentre os cinco que fizeram parte de nosso levantamento: Bolsonaro, Ciro, Moro, Lula e Dória, de acordo com a frequência com que os candidatos tuitaram na última semana.\n\n\n\n\n\nTuites sobre os candidatos\nNa sequência apresentamos em ordem decrescente (do mais citado ao menos citado), o total de tuites que mencionaram o nome de cada candidato pesquisado durante a última semana: Bolsonaro, Moro, Lula, Ciro e Dória.\n\nPara coletar os tuites mencionando os respectivos candidatos, foram utilizados como critério de busca as palavras “Bolsonaro”, “Ciro”, “Doria”, “Lula” e “Moro”.\n\n\n\n\n\nPor fim, apresentamos abaixo cinco nuvens de palavras, onde cada uma corresponde a um candidato, é importante sinalizar que o nome de cada candidato foi retirado da sua própria nuvem para melhor visualização das palavras a ele associadas. Cabe ressaltar também, que cada nuvem reflete as 100 palavras mais relevantes associadas, excluídas stop words, a cada candidato nas interações dos usuários do Twitter na última semana.\n\nUma nuvem de palavras é uma representação gráfica das palavras mais frequentes dentro de um texto ou conjunto de textos.\n\nClique no nome do candidato para ver a respectiva nuvem de palavras.\n\n\n\n\n\nBolsonaro\n\n\n\n\n\nMoro\n\n\n\n\n\nLula\n\n\n\n\n\nCiro\n\n\n\n\n\nDoria\n\n\n\n\n\n\nAo analisar as nuvens, compartilhamos a primeira impressão de cada uma:\nBolsonaro: governo, presidente, Brasil e Lula em destaque.\nMoro: Mamãe, MBL, falei, Arthur e Bolsonaro em destaque.\nLula: Bolsonaro, PT, Brasil, presidente e contra em destaque.\nCiro*: presidente, Lula, PRF, convocação e Brasil em destaque.\nDória: vídeo, orgia, Moro e vacina em destaque\n\n*Nos resultados relativos a Ciro, verificamos que termos como PRF e convocação estavam relacionados com uma mobilização entre os dias 8 e 9/3 relativa a um concurso de policiais rodoviários federais pedindo a convocação de candidatos. Fazendo uma busca na plataforma, encontramos tuites direcionados ao ministro da Casa Civil Ciro Nogueira, sendo captado na formação da nuvem do candidato Ciro Gomes nessa semana.\n\nComentários finais\nA apresentação desse conjunto de dados visa contribuir para interpretações sobre a movimentação no Twitter dos possíveis candidatos nas eleições de 2022, bem como sobre o que se fala a seu respeito nas interações dos usuários da plataforma na última semana. Esse é um trabalho de pesquisa em andamento e será aperfeiçoado no transcorrer das semanas.\n\n\n\n",
    "preview": "posts/2022-03-11-a-semana-dos-presidenciveis-no-twitter-4-a-103/Tweets_per_candidato_2022-03-04_2022-03-10.png",
    "last_modified": "2022-03-11T16:23:37-03:00",
    "input_file": {},
    "preview_width": 3425,
    "preview_height": 2244
  }
]
