[
  {
    "path": "posts/2022-06-15-maio-dos-presidenciveis-no-twitter/",
    "title": "Maio dos presidenciáveis no Twitter",
    "description": "Saiba o que tuitam e como são tuitados os presidenciáveis.",
    "author": [
      {
        "name": "Marcelo Castañeda",
        "url": "https://twitter.com/celocastaneda"
      },
      {
        "name": "Alessandra Maia",
        "url": "https://twitter.com/amaiatfaria"
      },
      {
        "name": "Carlos Trucíos",
        "url": "https://ctruciosm.github.io/"
      }
    ],
    "date": "2022-06-15",
    "categories": [],
    "contents": "\nComo os dados foram extraídos\nPara cada candidato, foram coletados tuítes referentes a cada um dos 31 dias do mês de maio, totalizando mais de 13 milhões de tuítes. Os dados foram extraídos através de uma API do twitter utilizada exclusivamente para fins acadêmicos e analisados utilizando o software R.\n\nOs autores agradecem ao Twitter pelas contas acadêmicas a eles concedidas.\nNúmero de seguidores\nA seguir, apresentamos o número atualizado (maio em relação a abril, dados de 15 de junho de 2022) de seguidores no Twitter de cada um dos candidatos.\nBolsonaro- de 7,8 para 8,2 milhões (acréscimo de 5,1% de seguidores em relação ao mês anterior)\nLula- de 3,4 para 3,6 milhões ( acréscimo de 5,9% de seguidores em relação ao mês anterior)\nCiro- 1,3 milhões (não foi verificada alteração)\nTuítes dos candidatos\nNa Figura 1 abaixo, apresentamos um gráfico com o número de tuítes da timeline dos candidatos, dentre os três que fazem parte de nosso levantamento: Ciro, Lula e Bolsonaro, de acordo com a frequência com que os candidatos tuitaram no mês de maio.\n\n\n\n\nFigure 1: Número de tuítes na timeline dos candidatos\n\n\n\n\nAs Figuras 2 e 3 apresentam as palavras mais frequentes nos tuítes da timeline dos candidatos, e as palavras mais frequentes nos tuítes da timeline dos candidatos que não foram tão frequentes nos tuítes da timeline dos outros candidatos, respectivamente.\n\n\n\n\nFigure 2: Palavras mais frequentes na timeline dos candidatos\n\n\n\n\nA análise das palavras mais frequentes nos tuítes da timeline dos candidatos (Figura 2) nos permite apresentar um panorama dominante dos assuntos por eles tratados. No perfil de Bolsonaro é possível apontar uma continuidade, em relação ao mês de abril, com destaque aos feitos do governo, em especial, aos gastos em “reais (r)” expressos em cifras de “bilhões” e “milhões”. A novidade consolidada em relação ao mês de abril surge na menção ao termo “impostos” associado a essas cifras. Já o perfil de Lula traz em destaque palavras como “país”, “Brasil”, “povo”, “todos”, “pessoas” e o enfoque no momento de “hoje”. No perfil de Ciro, se mantém a preocupação em mencionar nominalmente os outros dois candidatos, e é possível notar também, no consolidado do mês, as menções ao “povo”, “hoje”, “Brasil”, “gente” e “acompanhe”. Por fim, o termo “Brasil” é uma menção comum observável no perfil dos três candidatos.\n\n\n\n\nFigure 3: TF-IDF da timeline dos candidados\n\n\n\n\nNa Figura 3, TF-IDF (term frequency-inverse document frequency) reflete a frequência das palavras nos tuites da timeline dos candidatos, que não são tão frequentes para os três candidatos em geral. Assim:\nNo perfil de Lula, há uma continuidade nas ações propositivas com mais qualificações, através da ênfase dada ao uso de verbos como “espalhar”, “cuidar”, “estudar”, “trabalhar” e “queremos”. Surgem novos substantivos como “amor”, “universidade” e “universidades”. Interessante destacar que os dois termos, no singular e plural foram o assunto predominante no mês.\nO perfil de Bolsonaro apresenta em destaque os termos “impostos”, “contratação”, “medidas”, “federais”, “km” e “entregues”, termos característicos dos feitos do governo em curso. A referência ao ano de “2019” se mantém em relação ao encontrado em abril, a novidade é a menção ao ano de “2021” e ao número “4”.\nNo perfil de Ciro, a ênfase é dada às palavras “gregorio”, “debate” e “candidato” (referindo-se ao debate entre o candidato e Gregório Duvivier que aconteceu na segunda metade do mês de maio). As últimas palavras mencionadas (“vamos”, “participe”, “porque”, “minha”, “youtube” e “19:30”) fazem referência à live Ciro Games proferida pelo candidato toda terça-feira às 19:30 hrs.\n\nEm geral, pode-se observar que os tuítes do Bolsonaro centram-se nas ações realizadas durante seu governo em curso. Já os tuítes do Lula focam-se nas ações propositivas como candidato. Por último, os tuítes do Ciro destacam os recentes acontecimentos envolvendo o candidato.\n\nTuítes sobre os candidatos\nNa sequência, na Figura 4, apresentamos em ordem decrescente (do mais citado ao menos citado), o total de tuítes que mencionaram o nome de cada candidato pesquisado na primeira quinzena do mês de maio: Bolsonaro, Lula e Ciro.\n\nPara coletar os tuites mencionando os respectivos candidatos, foram utilizados como critério de busca as palavras “Bolsonaro”, “Ciro” e “Lula”. Tuítes mencionando “Ciro Nogueira” foram excluidos das análises referentes ao candidato Ciro.\n\n\n\n\nFigure 4: Total de tuítes sobre os candidatos\n\n\n\n\nEm relação ao mês de abril, se manteve a frequência anterior. É possível destacar, contudo, que diminui a distância que separava Bolsonaro e Lula. Em abril, essa distância era de quase 2 milhões de tuítes. Em maio, tal diferença cai para menos de um milhão. Comparado com o mês anterior, o número de tuítes mencionando os candidatos aumentou em aproximadamente 5% (Bolsonaro), 33% (Lula) e 39% (Ciro). É importante mencionar que a diferença do número de tuítes mencionando Bolsonaro e Lula é menor no mês de maio (menos de um milhão) do que no mês de abril (aproximadamente dois milhões).\nNa evolução diária do número de tuítes (Figura 5), pode-se observar que, em geral, Ciro apresenta a menor quantidade do número de tuítes (exceto no dia 21 de maio onde este número superou levemente o número de tuítes do Lula). Por outro lado, o número de tuítes mencionando Bolsonaro é, geralmente, maior do que os outros candidatos ao longo do mês, com exceção de 7 dias na primeira quinzena do mês, em que Lula apresentou uma quantidade diária de tuítes maior.\n\n\n\n\nFigure 5: Evolução diária da quantitate de tuítes sobre os candidatos\n\n\n\n\nNuvem de palavras\n\nUma nuvem de palavras é uma representação gráfica das palavras mais frequentes dentro de um texto ou conjunto de textos.\nA seguir, apresentamos três nuvens de palavras, onde cada uma corresponde a um candidato. É importante sinalizar que o nome de cada candidato foi retirado da sua própria nuvem, para melhor visualização das palavras associadas. Cabe ressaltar também, que cada nuvem reflete as 100 palavras mais relevantes associadas, excluídas stop words, a cada candidato nas interações dos usuários do Twitter nos 31 dias do mês de maio.\nClique no nome do candidato para ver a respectiva nuvem de palavras.\n\nEm análise de texto, stop words são palavras bastante comuns tais como “e”, “de”, “o”, etc. Essas palavras não são úteis para as análises e costumam ser removidas antes das análises.\n\n.panelset{--panel-tab-foreground: honeydew;--panel-tab-background: #0F2E3D;}\n\n\nBolsonaro\n\n\n\n\nFigure 6: Nuvem de Palavras do Bolsonaro\n\n\n\n\nLula\n\n\n\n\nFigure 7: Nuvem de Palavras do Lula\n\n\n\n\nCiro\n\n\n\n\nFigure 8: Nuvem de Palavras do Ciro\n\n\n\n\n\nAo analisar as nuvens, compartilhamos a primeira impressão de cada uma:\nBolsonaro: em primeiro plano se consolidam as palavras “Lula”, “Brasil” e “governo’’. Em segundo plano, “agora”, “contra”, “Moraes”, “hoje”, “povo”, “turno” e “STF”.\nLula: em primeiro plano aparecem “presidente”, “Brasil”, “PT”, “Ciro” e “turno”; em segundo plano “casamento”, “campanha”, “primeiro”, turno”, “Time”, “pesquisa”, “votar”, “voto”, “porque”, “quer”, “hoje”, “dia”, “gente”, “ter” e “agora”. Vale observar que a menção à palavra “Time” não se limitou à semana em que o ex-presidente Lula é capa da revista Time, mas se manteve no perfil mensal observado.\nCiro: a tendência se manteve em primeiro plano, de modo isolado, destacam-se as referências a “Lula”, “Bolsonaro”, “Gregorio” e “turno”; em segundo plano, “turno”, “Brasil”, “votar”, “agora”, “hoje”, “Duvivier”, e “debate”.\nAnálise de sentimentos\nO sentimento de cada tuíte foi construído através da identificação dos sentimentos das unidades básicas (as palavras) utilizando os dicionários oplexicon v3.0 e sentilex, do pacote lexiconPT. Assim, cada palavra encontrada nos dicionários recebe a nota 1, -1 ou 0, a depender de se o sentimento for positivo, negativo ou neutro, respectivamente. Palavras não encontradas nos dicionários recebem também nota 0. Os valores atribuídos a cada palavra dentro do tuíte foram somados, e a depender do resultado positivo, negativo ou zero, o sentimento do tuíte é classificado como positivo, negativo ou neutro. Na Figura 9 são apresentados os sentimentos (Negativo, Neutro e Positivo) percentualmente por candidato. É possível destacar um equilíbrio entre os sentimentos expressos nos tuítes dos três candidatos. Tais dados serão acompanhados ao longo do tempo comparativamente. Esse é um retrato, um instantâneo sentimental no mês de maio.\n\n\n\n\nFigure 9: Sentimentos dos tuítes por candidato\n\n\n\n\nA seguir, é possível observar a nuvem de palavras de cada um dos candidatos, apresentadas em separado, segundo os sentimentos atribuídos a cada tuíte. Palavras em verde aparecem nos tuítes classificados como associados a sentimentos positivos, palavras em vermelho aparecem nos tuítes classificados como associados a sentimentos negativos, e palavras em amarelo aparecem nos tuítes classificados como neutros.\n\nAs nuvens de palavras com sentimentos consideram as 200 palavras mais frequentes.\n\nBolsonaro\n\n\n\n\nFigure 10: Nuvem de Palavras do Bolsonaro com sentimentos.\n\n\n\n\nLula\n\n\n\n\nFigure 11: Nuvem de Palavras do Lula com sentimentos.\n\n\n\n\nCiro\n\n\n\n\nFigure 12: Nuvem de Palavras do Ciro com sentimentos.\n\n\n\n\n\nBolsonaro: Os tuítes relacionados ao candidato Bolsonaro que foram classificados como associados a sentimentos positivos estão caracterizados por palavras como “mundo”, “presidente”, “bom”, “melhor” e “reeleito”. Já os tuites classificados como associados a sentimentos negativos são caracterizados por palavras como “votar”, “culpa”, “cara” e “preso”. Por último, tuítes considerados como neutros são caracterizados por palavras como “Moraes”, “agora”, “urgente”, “governo” e “2022”.\nLula: Os tuítes relacionados ao candidato Lula que foram classificados como associados a sentimentos positivos estão caracterizados por palavras como “bom”, “sabe”, “mundo”, “ver”, “melhor” e “favor”. Já os tuítes classificados como negativos estão caracterizados por palavras como “votar”, “cara”, “XP” e “presidiário”. Por último, os tuítes com sentimento neutro estão caracterizados por palavras como “sai”, “presidente”, “primeiro”, “13”, “preso”, “Bolsonaro” e “showmício”.\nCiro: Os tuítes relacionados ao candidato Ciro que foram classificados como associados a sentimentos positivos estão caracterizados por palavras como “melhor”, “sabe”, “bom”, “boa” e “ver”. Já os tuítes classificados como negativos estão caracterizados por palavras como “votar”, “cara” e “debater”. Por último, os tuítes com sentimento neutro estão caracterizados por palavras como “fudendo”, “Bolsonaro”, “Doria”, “atrás” e “Lula”.\nBigramas\n\nBigramas são pares de palavras que aparecem conjuntamente ao longo dos tuítes.\nOs 25 bigramas mais frequentes nos tuítes mencionando cada um dos candidatos são apresentados nas Figuras 13 – 15. A direção da zeta revela a ordem em que o bigrama aparece e quanto maior a intensidade da zeta, maior a frequência do bigrama.\n\nBolsonaro\n\n\n\n\nFigure 13: Bigramas do Bolsonaro.\n\n\n\n\nLula\n\n\n\n\nFigure 14: Bigramas do Lula.\n\n\n\n\nCiro\n\n\n\n\nFigure 15: Bigramas do Ciro.\n\n\n\n\n\nBolsonaro: entre os bigramas mais frequentes temos “presidente \\(\\rightarrow\\) Bolsonaro”, “Jair \\(\\rightarrow\\) Bolsonaro” e “governo \\(\\rightarrow\\) Bolsonaro”. Outros bigramas diretamente relacionados a estes e que chamam nossa atenção são a sequência “Bolsonaro \\(\\rightarrow\\) contra \\(\\rightarrow\\) Alexandre” referindo-se à discrepância entre o atual presidente e o atual ministro do STF. Em sentido similar, as sequências “Flavio \\(\\rightarrow\\) Bolsonaro” e “Eduardo \\(\\rightarrow\\) Bolsonaro” são também frequentes, trazendo a referência a tuítes que podem não necessariamente se referir ao candidato presidencial, mas aos seus filhos. Também é possível destacar as menções laterais “Forças \\(\\rightarrow\\) Armadas”, “Elon \\(\\rightarrow\\) Musk” e “primeiro \\(\\rightarrow\\) turno”.\nLula: entre os bigramas mais frequentes temos “ex \\(\\rightarrow\\) presidente/presidiário \\(\\rightarrow\\) Lula”, que se desdobra, a partir do nome “Lula \\(\\rightarrow\\) quer”, “governo \\(\\rightarrow\\) Lula”, “ Lula \\(\\rightarrow\\) sai”, “Lula \\(\\rightarrow\\) diz”, “Lula \\(\\rightarrow\\) falou”, “Lula \\(\\rightarrow\\) disse”, “Lula \\(\\rightarrow\\) ladrão”, “Lula \\(\\rightarrow\\) nunca”, “Lula \\(\\rightarrow\\) contra“. Secundariamente, “primeiro \\(\\rightarrow\\) turno, “segundo \\(\\rightarrow\\) turno”, “Daniela \\(\\rightarrow\\) Mercury”, “classe \\(\\rightarrow\\) média”, “vou \\(\\rightarrow\\) votar”, “revista \\(\\rightarrow\\) time”, “fake \\(\\rightarrow\\) news”, “dinheiro \\(\\rightarrow\\) público”, dentre outros.\nCiro: entre os bigramas mais frequentes temos, predominantemente, “Ciro \\(\\rightarrow\\) Gomes”, “Ciro \\(\\rightarrow\\) games”, “Ciro \\(\\rightarrow\\) fala”, “Ciro \\(\\rightarrow\\) Lula”, “Sérgio \\(\\rightarrow\\) Moro”, seguido por “Bolsonaro \\(\\rightarrow\\) 31”, “terceira \\(\\rightarrow\\) via”, “segundo \\(\\rightarrow\\) turno”, “todo \\(\\rightarrow\\) mundo”, “ipespe \\(\\rightarrow\\) pesquisa”, “Gregorio \\(\\rightarrow\\) Duvivier”, “voto \\(\\rightarrow\\) útil”, dentre outros.\nComentários finais\nA apresentação desse conjunto de dados visa contribuir para interpretações sobre a movimentação no Twitter dos possíveis candidatos nas eleições de 2022, bem como sobre o que se fala a seu respeito nas interações dos usuários da plataforma no mês de maio. Esse é um trabalho de pesquisa em andamento e será aperfeiçoado no transcorrer dos meses até a eleição de 2022.\n\n\n\n",
    "preview": "posts/2022-06-15-maio-dos-presidenciveis-no-twitter/TF_IDF_timelines_Maio.png",
    "last_modified": "2022-06-17T09:52:42-03:00",
    "input_file": {},
    "preview_width": 3425,
    "preview_height": 2244
  },
  {
    "path": "posts/2022-05-24-maio-dos-presidenciveis-no-twitter-parte-i/",
    "title": "A primeira quinzena de maio dos presidenciáveis no twitter",
    "description": "Saiba o que tuitam e como são tuitados os presidenciáveis.",
    "author": [
      {
        "name": "Marcelo Castañeda",
        "url": "https://twitter.com/celocastaneda"
      },
      {
        "name": "Alessandra Maia",
        "url": "https://twitter.com/amaiatfaria"
      },
      {
        "name": "Carlos Trucíos",
        "url": "https://ctruciosm.github.io/"
      }
    ],
    "date": "2022-05-24",
    "categories": [],
    "contents": "\nComo os dados foram extraídos\nPara cada candidato, foram coletados tuítes referentes a cada um dos primeiros 15 dias do mês de maio, totalizando mais de 7 milhões de tuítes. Os dados foram extraídos através de uma API do twitter utilizada exclusivamente para fins acadêmicos e analisados utilizando o software R.\n\nOs autores agradecem ao Twitter pelas contas acadêmicas a eles concedidas.\nNúmero de seguidores\nA seguir, apresentamos o número atualizado (maio, 2022) de seguidores no Twitter de cada um dos candidatos.\nBolsonaro - 8 milhões (acréscimo de 2,5% de seguidores em relação ao boletim anterior)\nLula - 3,5 milhões ( acréscimo de 2,9% de seguidores em relação ao boletim anterior)\nCiro - 1,3 milhões (não foi verificada alteração)\nTuítes dos candidatos\nNa Figura 1 abaixo, apresentamos um gráfico com o número de tuítes da timeline dos candidatos, dentre os três que fizeram parte de nosso levantamento: Ciro, Lula e Bolsonaro, de acordo com a frequência com que os candidatos tuitaram na primeira quinzena do mês de maio.\n\n\n\n\nFigure 1: Número de tuítes na timeline dos candidatos\n\n\n\n\nAs Figuras 2 e 3 apresentam as palavras mais frequentes nos tuítes da timeline dos candidatos e as palavras mais frequentes nos tuítes da timeline dos candidatos que não foram tão frequentes nos tuítes da timeline dos outros candidatos, respectivamente.\n\n\n\n\nFigure 2: Palavras mais frequentes na timeline dos candidatos\n\n\n\n\n\n\n\n\nFigure 3: TF-IDF da timeline dos candidados\n\n\n\n\nA análise das palavras mais frequentes nos tuítes da timeline dos candidatos (Figura 2) nos permite apresentar um panorama dominante dos assuntos por eles tratados. No perfil de Bolsonaro é possível apontar uma continuidade, em relação ao mês de abril, com destaque aos feitos do governo, em especial, aos gastos em reais (r) expressos em cifras de milhões. A novidade surge na menção ao termo “impostos” associado a essas cifras. Já o perfil de Lula traz em destaque palavras como país, Brasil, povo, todos, pessoas e o enfoque no momento de “hoje”. No perfil de Ciro, se mantém a preocupação em mencionar nominalmente os outros dois candidatos, mas na primeira quinzena de maio, é possível notar menções ao povo, hoje, Brasil, gente e Petrobrás. Por fim, o termo Brasil é uma menção comum observável no perfil dos três candidatos.\nNa Figura 3, TF-IDF (term frequency-inverse document frequency) reflete a frequência das palavras nos tuites da timeline dos candidatos que não são tão frequentes para os três candidatos em geral. Assim:\nNo perfil de Lula, há uma continuidade nas ações propositivas com mais qualificações, através da ênfase dada ao uso de verbos como “defender, ter, recuperar, reconstruir, estudar e cuidar”. Surgem novos substantivos como “soberania” e “universidades”.\nO perfil de Bolsonaro apresenta em destaque os termos “impostos”, “contratação”, “medidas” e “entrega”. A referência ao ano de 2019 se mantém em relação ao encontrado em abril.\nNo perfil de Ciro, a ênfase é dada às ações como “assista” e “participe”, e aos termos “debate”, “Leonel”.\nTuítes sobre os candidatos\nNa sequência, na Figura 4, apresentamos em ordem decrescente (do mais citado ao menos citado), o total de tuítes que mencionaram o nome de cada candidato pesquisado na primeira quinzena do mês de maio: Lula, Bolsonaro e Ciro.\n\nPara coletar os tuites mencionando os respectivos candidatos, foram utilizados como critério de busca as palavras “Bolsonaro”, “Ciro” e “Lula”. Tuítes mencionando “Ciro Nogueira” foram excluidos das análises referentes ao candidato Ciro.\n\n\n\n\nFigure 4: Total de tuítes sobre os candidatos\n\n\n\n\nPara coletar os tuítes mencionando os respectivos candidatos, foram utilizados como critério de busca as palavras “Lula”, “Bolsonaro” e “Ciro”. Em relação ao mês de abril, se reverteu a tendência anterior. É possível destacar que no mês de maio às menções a Lula ultrapassam o número de menções a Bolsonaro, no universo do que foi observado na rede social Twitter.\nNa evolução diária do número de tuítes (Figura 5), pode-se observar que, à exceção dos dias 3 e 5, o número de menções a Lula é superior ao número de menções a Bolsonaro, na primeira semana do mês. Já na segunda semana, apenas nos dias 8 e 11 este mesmo fenômeno acontece, sendo observado o aumento no número de tuítes com menções a Bolsonaro, se considerado Lula, mas com uma distância inferior à observada na primeira semana.\n\n\n\n\nFigure 5: Evolução diária da quantitate de tuítes sobre os candidatos\n\n\n\n\nNuvem de palavras\n\nUma nuvem de palavras é uma representação gráfica das palavras mais frequentes dentro de um texto ou conjunto de textos.\nA seguir, apresentamos três nuvens de palavras, onde cada uma corresponde a um candidato. É importante sinalizar que o nome de cada candidato foi retirado da sua própria nuvem, para melhor visualização das palavras associadas. Cabe ressaltar também, que cada nuvem reflete as 100 palavras mais relevantes associadas, excluídas stop words, a cada candidato nas interações dos usuários do Twitter nos últimos quinze dias do mês de abril.\nClique no nome do candidato para ver a respectiva nuvem de palavras.\n\nEm análise de texto, stop words são palavras bastante comuns tais como “e”, “de”, “o”, etc. Essas palavras não são úteis para as análises e costumam ser removidas antes das análises.\n\n.panelset{--panel-tab-foreground: honeydew;--panel-tab-background: #0F2E3D;}\n\n\nBolsonaro\n\n\n\n\nFigure 6: Nuvem de Palavras do Bolsonaro\n\n\n\n\nLula\n\n\n\n\nFigure 7: Nuvem de Palavras do Lula\n\n\n\n\nCiro\n\n\n\n\nFigure 8: Nuvem de Palavras do Ciro\n\n\n\n\n\nAo analisar as nuvens, compartilhamos a primeira impressão de cada uma:\nBolsonaro: em primeiro plano, as palavras “presidente”, “Brasil”, “Lula” e “governo’’ se mantiveram sem alterações. Em segundo plano, “agora”, “contra”, “sobre”, “povo”, “hoje”; e, em terceiro plano, vem “primeiro”, “turno”, “eleições”, “Moraes”, “2022” e “todos” .\nLula: em primeiro plano aparecem “presidente” e “Brasil”; em segundo plano “time”, “PT”, “povo”, “campanha”, “gente”, “turno”, “sobre”; em terceiro plano, “Daniela”, “Mercury”, “Alckmin”, “ex”, “capa” e “votar”. Vale observar que a menção à palavra “capa” ocorre na semana em que o ex-presidente Lula é capa da revista Time.\nCiro: a tendência se manteve em primeiro plano, de modo isolado, destacam-se as referências a “Lula” e “Bolsonaro”; em segundo plano, “turno”, “Brasil”, “votar” e “voto”; em terceiro plano “coco”, “bambu”, “Doria”, “voto”, “primeiro”, “segundo” e “pesquisa”.\nAnálise de sentimentos\nO sentimento de cada tuíte foi construído através da identificação dos sentimentos das unidades básicas (as palavras) utilizando os dicionários oplexicon v3.0 e sentilex, do pacote lexiconPT. Assim, cada palavra encontrada nos dicionários recebe a nota 1, -1 ou 0, a depender de se o sentimento for positivo, negativo ou neutro, respectivamente. Palavras não encontradas nos dicionários recebem também nota 0. Os valores atribuídos a cada palavra dentro do tuíte foram somados, e a depender do resultado positivo, negativo ou zero, o sentimento do tuíte é classificado como positivo, negativo ou neutro. Na Figura 9 são apresentados os sentimentos (Negativo, Neutro e Positivo) percentualmente por candidato. É possível destacar um equilíbrio entre os sentimentos expressos nos tuítes dos três candidatos. Tais dados serão acompanhados ao longo do tempo comparativamente. Esse é um retrato, um instantâneo sentimental da primeira quinzena de maio.\n\n\n\n\nFigure 9: Sentimentos dos tuítes por candidato\n\n\n\n\nA seguir, é possível observar a nuvem de palavras de cada um dos candidatos, apresentadas em separado, segundo os sentimentos atribuídos a cada tuíte. Palavras em verde aparecem nos tuítes classificados como associados a sentimentos positivos, palavras em vermelho aparecem nos tuítes classificados como associados a sentimentos negativos, e palavras em amarelo aparecem nos tuítes classificados como neutros.\n\nBolsonaro\n\n\n\n\nFigure 10: Nuvem de Palavras do Bolsonaro com sentimentos.\n\n\n\n\nLula\n\n\n\n\nFigure 11: Nuvem de Palavras do Lula com sentimentos.\n\n\n\n\nCiro\n\n\n\n\nFigure 12: Nuvem de Palavras do Ciro com sentimentos.\n\n\n\n\n\nBolsonaro: Os tuítes relacionados ao candidato Bolsonaro que foram classificados como associados a sentimentos positivos estão caracterizados por palavras como bom, presidente, reeleito e santa, entre outros. Já os tuites classificados como associados a sentimentos negativos são caracterizados por palavras como votar, culpa, cara, medo,, etc. Por último, tuítes considerados como neutros são caracterizados por palavras como tirar, governo e urgente.\nLula: Os tuítes relacionados ao candidato Lula que foram classificados como associados a sentimentos positivos estão caracterizados por palavras como segurança, importante, favor, bom, mundo, voto, etc. Já os tuítes classificados como negativos estão caracterizados por palavras como votar, cara, culpa, XP, dar, medo. Por último, os tuítes com sentimento neutro estão caracterizados por palavras como showmício, candidatura, Daniela, Mercury, mesma.\nCiro: Os tuítes relacionados ao candidato Ciro que foram classificados como associados a sentimentos positivos estão caracterizados por palavras como Doria, sabe, melhor, votar, Coco, etc. Já os tuítes classificados como negativos estão caracterizados por palavras como Bolsonaro, votar, cara, como, vagabundo, etc. Por último, os tuítes com sentimento neutro estão caracterizados por palavras como Lula, Tebet, emplacou, bolsonaro, entre outras.\nComentários finais\nA apresentação desse conjunto de dados visa contribuir para interpretações sobre a movimentação no Twitter dos possíveis candidatos nas eleições de 2022, bem como sobre o que se fala a seu respeito nas interações dos usuários da plataforma na primeira quinzena do mês de maio. Esse é um trabalho de pesquisa em andamento e será aperfeiçoado no transcorrer dos meses até a eleição de 2022.\n\n\n\n",
    "preview": "posts/2022-05-24-maio-dos-presidenciveis-no-twitter-parte-i/Tweets_per_candidato_Maio1_.png",
    "last_modified": "2022-05-24T10:17:58-03:00",
    "input_file": {},
    "preview_width": 3425,
    "preview_height": 2244
  },
  {
    "path": "posts/2022-05-02-abril-dos-presidenciveis-no-twitter/",
    "title": "Abril dos presidenciáveis no Twitter",
    "description": "Saiba o que tuitam e como são tuitados os presidenciáveis.",
    "author": [
      {
        "name": "Marcelo Castañeda",
        "url": "https://twitter.com/celocastaneda"
      },
      {
        "name": "Alessandra Maia",
        "url": "https://twitter.com/amaiatfaria"
      },
      {
        "name": "Carlos Trucíos",
        "url": "https://ctruciosm.github.io/"
      }
    ],
    "date": "2022-05-02",
    "categories": [],
    "contents": "\nComo os dados foram extraídos\nPara cada candidato, foram coletados tuítes referentes a cada um dos 30 dias do mês de abril, totalizando mais de 11 milhões de tuítes. Os dados foram extraídos através de uma API do twitter utilizada exclusivamente para fins acadêmicos e analisados utilizando o software R.\n\nOs autores agradecem ao Twitter pelas contas acadêmicas a eles concedidas.\nContexto geral\nCabe ressaltar a disparidade entre o número de seguidores no Twitter dos candidatos durante o período de análise (abril, 2022).\nBolsonaro - 7,8 milhões\nLula - 3,4 milhões\nCiro - 1,3 milhões\nTuítes dos candidatos\nNa Figura 1 abaixo, apresentamos um gráfico com o número de tuítes da timeline dos candidatos, dentre os três que fizeram parte de nosso levantamento: Ciro, Lula e Bolsonaro, de acordo com a frequência com que os candidatos tuitaram no mês abril.\n\n\n\n\nFigure 1: Número de tuítes na timeline dos candidatos\n\n\n\n\nAs Figuras 2 e 3 apresentam as palavras mais frequentes nos tuítes da timeline dos candidatos e as palavras mais frequentes nos tuítes da timeline dos candidatos que não foram tão frequentes nos túites da timeline dos outros candidatos, respectivamente.\n\n\n\n\nFigure 2: Palavras mais frequentes na timeline dos candidatos\n\n\n\n\nA análise das palavras mais frequentes nos tuítes da timeline dos candidatos nos permite apresentar um panorama dominante dos assuntos por eles tratados. Enquanto o perfil de Bolsonaro dá destaque aos feitos do governo, em especial os gastos em reais (r) expressos em cifras de milhões e bilhões, o perfil de Lula dá destaque ao povo e traz uma chave positiva, com o termo “bom”. Já o perfil de Ciro, se preocupa em mencionar nominalmente os outros dois candidatos. Por fim, o termo governo é tema comum ao perfil dos três candidatos.\n\n\n\n\nFigure 3: TF-IDF da timeline dos candidados\n\n\n\n\nTF-IDF (term frequency-inverse document frequency) reflete a frequência das palavras nos tuítes da timeline dos candidatos que não são tão frequentes para os três candidatos em geral. Assim:\nO perfil de Lula se destaca pelas ações propositivas, através da ênfase dada ao uso de verbos como “fazer, recuperar, reconstruir”.\nO perfil de Bolsonaro apresenta em destaque a palavra “Telegram”, a menção a “ações, bilhões e títulos”, bem como a ênfase em “redução”, procurando comparar o que seu governo realizou entre 2019 e 2021.\nNo perfil de Ciro, a ênfase é dada ao Ceará e Lula.\nVale acrescentar que os três perfis falam das pessoas em si dos candidatos. Ou seja, Lula e Ciro aos nomes diretamente, e Bolsonaro através das referências a “Jair” e “pr”.\nAinda a título de últimas observações, os palavras “ONU, zanin e cristiano” figuram nas menções do perfil de Lula, associadas à decisão do Comitê de Direitos Humanos da ONU sobre sua sentença na Lava Jato. É importante também mencionar que a palavra “et” no perfil do Lula, refere-se à palavra em francês et (que significa “e”) quando tuítes na timeline do candidato são postados em francês. Por último, a alta frequência observada no termo “19h30” na timeline do candidato Ciro Gomes, faz referência à live “Ciro Games” que acontece nesse horário.\nTuítes sobre os candidatos\nNa sequência, na Figura 4, apresentamos em ordem decrescente (do mais citado ao menos citado), o total de tuítes que mencionaram o nome de cada candidato pesquisado no mês de abril: Bolsonaro, Lula e Ciro.\n\nPara coletar os tuítes mencionando os respectivos candidatos, foram utilizados como critério de busca as palavras “Bolsonaro”, “Ciro” e “Lula”.\n\n\n\n\nFigure 4: Total de tuítes sobre os candidatos\n\n\n\n\nÉ importante mencionar que, devido ao critério de busca utilizado e como será apresentado posteriormente, os tuítes referentes ao candidato Ciro Gomes incluem também tuítes referentes ao Ministro da Casa Civil, Ciro Nogueira. Apesar disso, o número de tuítes sobre Ciro Gomes é menor do que a oitava parte do número de tuítes referentes ao candidato Jair Bolsonaro e menor do que a quinta parte do número de tuítes referentes ao candidato Luiz Lula. A cada três tuites falando de Bolsonaro, dois falam de Lula; nesse sentido, as interações envolvendo o nome de Ciro não parecem ser relevantes.\n\n\n\n\nFigure 5: Evolução diária da quantitate de tuítes sobre os candidatos\n\n\n\n\nA Figura 5 apresenta a evolução diária do número de tuítes a respeito dos candidatos. A superioridade do número de tuítes que mencionam Lula e Bolsonaro em relação ao número de tuítes que mencionam Ciro é indiscutível e persiste ao longo do mês inteiro. Por outro lado, embora o número de tuítes a respeito de Bolsonaro seja, em geral, superior ao número de tuítes sobre o candidato Lula, existem 2 períodos do tempo em que o volume de tuítes sobre Lula supera o volume de tuítes acerca de Bolsonaro.\nNuvem de palavras\n\nUma nuvem de palavras é uma representação gráfica das palavras mais frequentes dentro de um texto ou conjunto de textos.\nPor fim, apresentamos abaixo três nuvens de palavras, onde cada uma corresponde a um candidato. É importante sinalizar que o nome de cada candidato foi retirado da sua própria nuvem, para melhor visualização das palavras a ele associadas. Cabe ressaltar também, que cada nuvem reflete as 100 palavras mais relevantes associadas, excluídas stop words, a cada candidato nas interações dos usuários do Twitter no último mês de abril.\nClique no nome do candidato para ver a respectiva nuvem de palavras.\n\nEm análise de texto, stop words são palavras bastante comuns tais como “e”, “de”, “o”, etc. Essas palavras não são úteis para as análises e costumam ser removidas antes das análises.\n\n.panelset{--panel-tab-foreground: honeydew;--panel-tab-background: #0F2E3D;}\n\n\nBolsonaro\n\n\n\n\n\nLula\n\n\n\n\n\nCiro\n\n\n\n\n\n\nAo analisar as nuvens, compartilhamos a primeira impressão de cada uma:\nBolsonaro: em primeiro plano, as palavras “presidente”, “Brasil”, “Lula” e “governo’’; em segundo plano, “indulto”, “Daniel” e “Silveira”, que se associam a “STF”, “povo”, e a palavra “contra”; em terceiro plano, vem “motociata”, “corrupção”, “voto” e “PT”. Pode-se destacar que, dentre os candidatos investigados, a nuvem de Bolsonaro é mais dispersa e apresenta menos substantivos.\nLula: em primeiro plano, e em igual equivalência aparecem “presidente”, “Alckmin”, “Brasil” e “PT”; em segundo plano “Moro”, “sobre” e “contra”; em terceiro plano, “agora”, “diz”, “Ciro”, “povo”, “ONU”, “ladrão” e “votar”. Pode-se destacar que a nuvem de Lula possui maior densidade na frequência observada das palavras, sejam elas verbos, substantivos ou adjetivos, quando comparada às demais.\nCiro\\(^{\\ast}\\): em primeiro plano, de modo isolado, destacam-se as referências a “Lula” e “Bolsonaro”; em segundo plano, “Nogueira”, “Brasil”, “turno” e “presidente”; em terceiro plano “agrishow”, “agora”, “votar”, voto”, “PT”, “Doria”, “governo”, “contra” e “diz”.\n\n*Fazendo uma busca na plataforma, encontramos tuites direcionados ao ministro da Casa Civil Ciro Nogueira, sendo captados na formação da nuvem do candidato Ciro Gomes nesse mês de abril.\n\nAnálise de sentimentos\nO sentimento de cada tuíte foi construído através da identificação dos sentimentos das unidades básicas (as palavras) utilizando os dicionários oplexicon v3.0 e sentilex, do pacote lexiconPT. Assim, cada palavra encontrada nos dicionários recebe a nota 1, -1 ou 0, a depender de se o sentimento for positivo, negativo ou neutro, respectivamente. Palavras não encontradas nos dicionários recebem também nota 0. Os valores atribuídos a cada palavra dentro do tuíte foram somados, e a depender do resultado positivo, negativo ou zero, o sentimento do tuíte é classificado como positivo, negativo ou neutro.\nA seguir, é possível observar a nuvem de palavras de cada um dos candidatos, apresentada em separado, segundo os sentimentos atribuídos a cada tuíte. Palavras em verde aparecem nos tuítes classificados como associados a sentimentos positivos, palavras em vermelho aparecem nos tuítes classificados como associados a sentimentos negativos, e palavras em amarelo aparecem nos tuítes classificados como neutros.\n\nBolsonaro\n\n\n\n\n\nLula\n\n\n\n\n\nCiro\n\n\n\n\n\n\nBolsonaro\nOs tuítes relacionados ao candidato Bolsonaro que foram classificados como associados a sentimentos positivos estão caracterizados por palavras como Brasil, liberdade, reeleito, supremo, democracia, entre outros. Já os tuites classificados como associados a sentimentos negativos são caracterizados por palavras como corrupção, corrupto, culpa, votar, bandido, governo, tortura, vergonha, horrível, mentiroso, etc. Por último, tuítes considerados como neutros são caracterizados por palavras como presidente, indulto, lula e motociata.\nLula\nOs tuítes relacionados ao candidato Lula que foram classificados como associados a sentimentos positivos estão caracterizados por palavras como bom, verdade, mundo, sabe, ver, onu, livre, inocente, democracia, humanos, companheiros, direitos, melhor, novo, etc. Já os tuítes classificados como negativos estão caracterizados por palavras como votar, corrupção, presidiário, condenado, prisão, bandido. Por último, os tuítes com sentimento neutro estão caracterizados por palavras como Bolsonaro, Alckmin, socialista, internacional, cristão, advogados.\nCiro\nOs tuítes relacionados ao candidato Ciro que foram classificados como associados a sentimentos positivos estão caracterizados por palavras como convocação, aprovados, todos, pf, ver, etc. Já os tuítes classificados como negativos estão caracterizados por palavras como Bolsonaro, votar, pensa, corrupção, xingado, ignorado, quadrilhão, agrishow, vaiado, etc. Por último, os tuítes com sentimento neutro estão caracterizados por palavras como Lula, contra, pl, 21, nunca, evento entre outras.\nComentários finais\nA apresentação desse conjunto de dados visa contribuir para interpretações sobre a movimentação no Twitter dos possíveis candidatos nas eleições de 2022, bem como sobre o que se fala a seu respeito nas interações dos usuários da plataforma no mês de abril. Esse é um trabalho de pesquisa em andamento e será aperfeiçoado no transcorrer dos meses até a eleição de 2022.\n\n\n\n",
    "preview": "posts/2022-05-02-abril-dos-presidenciveis-no-twitter/Tweets_per_candidato_Abril_.png",
    "last_modified": "2022-05-06T12:07:51-03:00",
    "input_file": {},
    "preview_width": 3425,
    "preview_height": 2244
  },
  {
    "path": "posts/2022-03-11-a-semana-dos-presidenciveis-no-twitter-4-a-103/",
    "title": "A semana dos presidenciáveis no Twitter (4 a 10/3)",
    "description": "Saiba o que tuitam e como são tuitados os presidenciáveis.",
    "author": [
      {
        "name": "Marcelo Castañeda",
        "url": "https://twitter.com/celocastaneda"
      },
      {
        "name": "Alessandra Maia",
        "url": "https://twitter.com/amaiatfaria"
      },
      {
        "name": "Carlos Trucíos",
        "url": "https://ctruciosm.github.io/"
      }
    ],
    "date": "2022-03-11",
    "categories": [],
    "contents": "\nComo os dados foram extraídos\nPara cada candidato, foram coletados tuites referentes aos últimos 7 dias (da sexta-feira 4 de março até a quinta-feira 10 de março) totalizando, aproximadamente, 2 milhões de tweets. Os dados foram extraídos através de uma API do twitter utilizada exclusivamente para fins acadêmicos e analisados utilizando o software R.\nContexto geral\nCabe primeiro ressaltar a disparidade entre o número de seguidores no Twitter por candidato pesquisado nessa última semana, o que vai influenciar sobremaneira a análise dos dados.\nBolsonaro - 7,4 milhões\nMoro - 3,3 milhões\nLula - 3,1 milhões\nDória - 1,5 milhões\nCiro - 1,3 milhões\nTuites dos candidatos\nAbaixo apresentamos um gráfico com o número de tuites da timeline dos candidatos, dentre os cinco que fizeram parte de nosso levantamento: Bolsonaro, Ciro, Moro, Lula e Dória, de acordo com a frequência com que os candidatos tuitaram na última semana.\n\n\n\n\n\nTuites sobre os candidatos\nNa sequência apresentamos em ordem decrescente (do mais citado ao menos citado), o total de tuites que mencionaram o nome de cada candidato pesquisado durante a última semana: Bolsonaro, Moro, Lula, Ciro e Dória.\n\nPara coletar os tuites mencionando os respectivos candidatos, foram utilizados como critério de busca as palavras “Bolsonaro”, “Ciro”, “Doria”, “Lula” e “Moro”.\n\n\n\n\n\nPor fim, apresentamos abaixo cinco nuvens de palavras, onde cada uma corresponde a um candidato, é importante sinalizar que o nome de cada candidato foi retirado da sua própria nuvem para melhor visualização das palavras a ele associadas. Cabe ressaltar também, que cada nuvem reflete as 100 palavras mais relevantes associadas, excluídas stop words, a cada candidato nas interações dos usuários do Twitter na última semana.\n\nUma nuvem de palavras é uma representação gráfica das palavras mais frequentes dentro de um texto ou conjunto de textos.\n\nClique no nome do candidato para ver a respectiva nuvem de palavras.\n\n\n.panelset{--panel-tab-foreground: honeydew;--panel-tab-background: #0F2E3D;}\n\n\nBolsonaro\n\n\n\n\n\nMoro\n\n\n\n\n\nLula\n\n\n\n\n\nCiro\n\n\n\n\n\nDoria\n\n\n\n\n\n\nAo analisar as nuvens, compartilhamos a primeira impressão de cada uma:\nBolsonaro: governo, presidente, Brasil e Lula em destaque.\nMoro: Mamãe, MBL, falei, Arthur e Bolsonaro em destaque.\nLula: Bolsonaro, PT, Brasil, presidente e contra em destaque.\nCiro*: presidente, Lula, PRF, convocação e Brasil em destaque.\nDória: vídeo, orgia, Moro e vacina em destaque\n\n*Nos resultados relativos a Ciro, verificamos que termos como PRF e convocação estavam relacionados com uma mobilização entre os dias 8 e 9/3 relativa a um concurso de policiais rodoviários federais pedindo a convocação de candidatos. Fazendo uma busca na plataforma, encontramos tuites direcionados ao ministro da Casa Civil Ciro Nogueira, sendo captado na formação da nuvem do candidato Ciro Gomes nessa semana.\n\nComentários finais\nA apresentação desse conjunto de dados visa contribuir para interpretações sobre a movimentação no Twitter dos possíveis candidatos nas eleições de 2022, bem como sobre o que se fala a seu respeito nas interações dos usuários da plataforma na última semana. Esse é um trabalho de pesquisa em andamento e será aperfeiçoado no transcorrer das semanas.\n\n\n\n",
    "preview": "posts/2022-03-11-a-semana-dos-presidenciveis-no-twitter-4-a-103/Tweets_per_candidato_2022-03-04_2022-03-10.png",
    "last_modified": "2022-03-11T16:23:37-03:00",
    "input_file": {},
    "preview_width": 3425,
    "preview_height": 2244
  }
]
